{"en":"<div class=\"article-cat\"><a href=\"#2100018753-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018753-en\"><div class=\"\"> <h3>About the GCTools</h3></div></a><div id=\"2100018753-en\" class=\"collapse\"><div class=\"folder\"><a href=\"#2100028949-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100028949-en\"><div class=\"\"> <h4>About GCconnex</h4></div></a><div id=\"2100028949-en\" class=\"collapse\"><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027135-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027135-en\"><div class=\"panel-heading\"> <h5>What is GCconnex?</h5></div></a><div id=\"2100027135-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>GCconnex is a professional networking and collaborative workspace for all public servants, allowing them to connect and share information, leveraging the power of networking towards a more effective and efficient public service.</p><p><br></p><p>It features dynamic online communities where public servants can collaborate on projects, blog, chat via instant messaging, carry on discussions, ask and answer each other's questions about anything from learning to technology, such as WebEx. It acts as a professional platform to create your professional C.V., share ideas on The Wire, and connect you with people and information that you need. Also, GCconnex groups can be open to anyone interested in a particular subject area, or closed, where users can request to join and must be accepted by the group owners, to invitation-only, where only those invited to join will even be able to see that the group exists.</p><p><br></p><p>Register <a href=\"https://gcconnex.gc.ca/register\">here</a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027149-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027149-en\"><div class=\"panel-heading\"> <h5>Who can use GCconnex?</h5></div></a><div id=\"2100027149-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>Users are free to use GCconnex as they see fit, within the codes of conduct of their respective organizations.</p><p><br></p><p>Canadian public servants of departments and agencies of the Government of Canada with access to SCNet can access GCconnex.</p><p><br></p><p>Register for GCconnex <a href=\"https://gcconnex.gc.ca/register\"><u>here</u></a>.</p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 1</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027152-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027152-en\"><div class=\"panel-heading\"> <h5>What can we do with GCconnex?</h5></div></a><div id=\"2100027152-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p><strong>Enhance Team Dynamics</strong></p><p>Having access to GCconnex empowers users to make suggestions, interact openly and surface issues and ideas to improve the work environment. Users can search and find like-minded individuals and enhance collaboration, networking and best practices, while contributing to the creation of stronger communities. Additionally, by responding to requests or promoting their knowledge, they can engage their passions, sometimes outside of the formal boundaries of their roles.</p><p><br></p><p><strong>Effective Meetings</strong></p><p>GCconnex can help enhance effective meetings, facilitate people working and collaborate on projects in between meetings. Using a GCconnex group and/or the Chatroom functionalities, meetings can be replaced altogether.</p><p><br></p><p><strong>Share Content</strong></p><p>GCconnex can be great places to draft, store, and distribute meeting agendas and minutes; improving sharing and access to these documents or tools across worksites and regions. In addition, users can upload related materials such as presentations and handouts, keeping everything together. By using group discussions, no-one gets left out of email chains, reply-to-all discussions stop clogging your email and you have a record of all changes and contributors.</p><p><br></p><p><strong>Centralize Content</strong></p><p>GCconnex can be used to centralize the information and organization of an entire project. Not only could it store meeting notes and provide brainstorming space, it can organize a project into an open environment with two-way communication. By putting key documents on GCconnex and encouraging open collaboration, this reduces the risk of key documents being lost in someone’s email folder or losing key information when a contributor moves on.</p><p><br></p><p><strong>Manage Knowledge and Organize Your Team</strong></p><p>Maintaining team information within a GCconnex group enables new employees to easily access information, eliminating redundant processes, such as having someone email them the information. Because of the group functionality, it is easy for someone new to identify their new teammates, send messages, ask questions to the group, and read earlier discussions, etc. GCconnex can be your one-stop location for information and collaboration.</p><p><br></p><p>There are many ways to get started. Here are some simple suggestions:</p><ul>\n<li><p><strong>Join a group</strong> and <strong>participate in the group’s discussions</strong> – you’ll find people whose ideas you agree with, and others that challenge some of your thinking. If you decide you’d like to continue a conversation with just one individual, making them a colleague will give you the option to chat with them in real time or receive notification messages of their GCconnex activity, or you can message them directly.</p></li>\n<li><p><strong>Comment on postings on The Wire</strong> – answer a question or support a comment with a “thumbs up”. Expressing yourself online may feel odd at first, so start with small steps if you need to. It will become second nature if you keep it up.</p></li>\n<li><p><strong>Post on \"The Wire\"</strong> - an article, a news item, an observation of 140 characters or less (just like Twitter – but internal to the GC). Your post will allow others to know a bit about what you’re interested in.</p></li>\n<li><p><strong>Share your thoughts</strong> in groups you belong to, or write a blog to share.</p></li>\n<li><p><strong>Ask questions, respond to people</strong> - don't be afraid to show what you don't know, and show what you do know - share your expertise.</p></li>\n</ul><p><br></p><p>Register for GCconnex <a href=\"https://gcconnex.gc.ca/register\"><u>here</u></a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027154-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027154-en\"><div class=\"panel-heading\"> <h5>Do I need permission to use GCconnex? Who has access to GCconnex?</h5></div></a><div id=\"2100027154-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>No. You do NOT require permission to access GCconnex.&nbsp;</p><p><br></p><p>The system can only create GCconnex accounts using a valid Government of Canada email address ending in gc.ca or canada.ca.&nbsp;</p><p><br></p><p>Register for GCconnex <a href=\"https://gcconnex.gc.ca/register\">here</a>.&nbsp;</p><p><br></p><p><br></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027153-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027153-en\"><div class=\"panel-heading\"> <h5>Is there a cost to using GCconnex?</h5></div></a><div id=\"2100027153-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>No. GCconnex is free to use for all public servants. Get started <a href=\"https://gcconnex.gc.ca/register\">here</a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027150-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027150-en\"><div class=\"panel-heading\"> <h5>Can't I just browse anonymously? Why should I create an account?</h5></div></a><div id=\"2100027150-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>Unfortunately, you can’t browse GCconnex anonymously. All users must be registered to browse. All registered users can browse, network, share information and collaborate.</p><p><br></p><p>Register for GCconnex <a href=\"https://gcconnex.gc.ca/register\"><u>here</u></a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027176-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027176-en\"><div class=\"panel-heading\"> <h5>What is Jobs Marketplace?</h5></div></a><div id=\"2100027176-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p><a href=\"https://gcconnex.gc.ca/groups/profile/7617072/\" rel=\"nofollow\"><u>Jobs Marketplace</u></a> is a public service-wide Internet forum, created within &nbsp;<a href=\"https://gcconnex.gc.ca/\" rel=\"nofollow\"><u>GCconnex</u></a>, that enables employees to network professionally across departments. Jobs Marketplace is intended for <strong>at-level mobility</strong> (e.g. indeterminate and term deployments, secondments, and assignments), as well as <strong>casual employment</strong>, <strong>students</strong> seeking employment opportunities, <strong><a href=\"https://gcconnex.gc.ca/groups/profile/15328959/micro-missions\" rel=\"nofollow\"><u>micro-mission</u></a></strong> opportunities as well as a reference page to <strong>other sources of talent</strong> that managers and <span data-hasqtip=\"0\">HR</span> professionals may wish to explore, including <a href=\"https://gcconnex.gc.ca/groups/profile/10118612/central-repository-of-active-federal-public-service-pools-repertoire-central-de-bassins-actifs-au-sein-de-la-fonction-publique-federale\" rel=\"nofollow\"><u>active pools from other departments</u></a>. Jobs Marketplace can also be used as a tool to facilitate <strong>alternations</strong> during workforce adjustment situations.<br><br>&nbsp;Jobs Marketplace facilitates people management by improving access for managers to inventories of motivated employees ready and willing to take on new challenges. It also enables employee engagement, discussion and learning, both through the potential opportunities that Jobs Marketplace offers, and through the use of the tool itself.<br><br></p><p>The Jobs Marketplace has a new automated matching tool, the <strong><a href=\"https://gcconnex.gc.ca/missions/main\" rel=\"nofollow\"><u>Career ConneXions Opportunities Platform</u></a></strong>. This is a tool that quickly matches at-level mobility (i.e. micro-missions and job swapping) and development (i.e. mentoring and job shadowing) opportunities with talented employees by leveraging the content in employees’ GCconnex profiles. Employees are encouraged to “opt in” to the professional development and at-level mobility opportunities in their profiles to take full advantage of this tool.</p><p><br>&nbsp;Jobs Marketplace is being enhanced to make it a one-stop shop for managers and employees to navigate new features for public service staffing, resourcing and development. Check Jobs Marketplace regularly to take advantage of the new features and information!&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027169-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027169-en\"><div class=\"panel-heading\"> <h5>What is the Wire?</h5></div></a><div id=\"2100027169-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>Similar to Twitter, the Wire is a micro-blog. Users can post text with a 140 character limit to easily and quickly share information. You can search the Wire by hashtags, keywords, and @mentions and you will receive a notification when a fellow user tags you in a Wire post or conversation in a discussion, comment, or blog.</p><p><br></p><p>Post an event you're excited about, promote your group, or pose a question to the GCconnex community. Write on <a href=\"https://gcconnex.gc.ca/thewire/all\">the Wire</a> today.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027159-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027159-en\"><div class=\"panel-heading\"> <h5>Are there administrative functions that managers can access on GCconnex?</h5></div></a><div id=\"2100027159-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>There are no explicit administrative functions that managers can access. However, any user who creates a group in GCconnex or is designated as a group operator will have administrative privileges for that group including content options, membership, and visibility. Managers can create a group and acquire these privileges.&nbsp;</p><p><br></p><p>As a group owner, you can set the default content access level to be open to all users or only available to group members. While moderation issues are rare, group owners can also manage content within a group setting.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027144-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027144-en\"><div class=\"panel-heading\"> <h5>What about Official Languages?</h5></div></a><div id=\"2100027144-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>We respect the Official Languages Act and are committed to providing all functionalities of GCconnex in both official languages. When posting content, you should consider your role within your organization, your work responsibilities and your intended audience. We recommend that official content and content intended for broad dissemination be provided in both official languages as a best practice.</p><p><br></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027139-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027139-en\"><div class=\"panel-heading\"> <h5>How secure/safe is GCconnex?</h5></div></a><div id=\"2100027139-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>The GCTools team routinely monitors network traffic to identify unauthorized attempts to upload or change information, or otherwise cause damage. We track network traffic information such as, the Internet Protocol (IP) address of the computer, the date and time of visits, and the pages visited. We make no attempt to link the information with the identity of individuals unless an attempt to damage the site has been detected.</p><p><br></p><p>For public servants, only material that is classified Protected A or below should be posted on the GCTools.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027140-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027140-en\"><div class=\"panel-heading\"> <h5>Is GCconnex vulnerable to inaccurate information?</h5></div></a><div id=\"2100027140-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>Given that any registered user can add content, of course it is possible for biased, out-of-date, or incorrect information to be posted. You are encouraged to help by correcting information, validating content, and providing useful references. Thus, the overall accuracy of information on GCconnex is improving all the time.</p><p><br></p><p>It is the responsibility of each individual who posts content to maintain its accuracy. There is no way of enforcing accuracy. Each individual must be trusted to be effective in sharing information. It should be noted however that any user can and should correct that which they know is wrong. As a reader you need to use your judgment about the credibility, timeliness, reliability, and accuracy of what you read on GCconnex.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027141-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027141-en\"><div class=\"panel-heading\"> <h5>Is GCconnex vulnerable to vandals?</h5></div></a><div id=\"2100027141-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>Like all virtual workspaces where individuals are invited to participate and make contributions, there is the risk that an individual could disrupt the creative process or vandalize the product itself. However, there are a number of mechanisms in place to mitigate this risk and incentives to dissuade inappropriate or destructive behavior within the GCconnex community.</p><p><br></p><p>1. GCconnex users are required to use their real names and professional email addresses when registering. Pseudonyms or 'handles' are not permitted.</p><p>2. GCconnex is a business tool. It is unlikely that an individual will risk their professional reputation for the sake of mischief.</p><p>3. Given that everything that happens in GCconnex is fully documented and tied back to a unique user account, it is easy to identify someone who vandalizes or posts inappropriate content on a GCconnex page.</p><p><br></p><p>When using GCconnex, public servants are expected to abide by the <a href=\"http://www.tbs-sct.gc.ca/pol/doc-eng.aspx?id=25049\"><u>Value and Ethics Code for the Public Service</u></a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027143-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027143-en\"><div class=\"panel-heading\"> <h5>What happens if someone posts inappropriate information on GCconnex?</h5></div></a><div id=\"2100027143-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>All content is attributable as all entries are automatically date and time stamped with the contributors valid e-mail address. Inappropriate content can be removed very quickly. Participants of GCconnex that come across inappropriate content are encouraged to bring it to the attention of the <a href=\"https://gcconnex.gc.ca/mod/contactform/\">GCTools team</a>.</p><p><br></p><p>If necessary, GCconnex administrators can remove the inappropriate content and suspend a user’s account.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027136-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027136-en\"><div class=\"panel-heading\"> <h5>How does GCconnex protect my privacy?</h5></div></a><div id=\"2100027136-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p><strong>Collection</strong></p><ul type=\"disc\">\n<li>All personal information within GCconnex is considered to be voluntarily provided and any use or disclosure will be governed by the rights of access to, correction of and protection of personal information under the Privacy Act.</li>\n<li>GCconnex users are advised that all information / content posted to a federal government wiki, blog or other collaborative site is subject to the provisions of the Access to Information Act and the Privacy Act. This implies that information may be accessed and disclosed in response to a request under either of these Acts.</li>\n<li>For maximum privacy protection, it is recommended that users do not post personal information such as photographs, home addresses, resumes etc., as this information would then be available to all users. Note however that the Privacy Act does not require any protection for certain types of personal information such as is relevant to the positions and functions of public servants therefore, this type of personal information can be posted and is in fact encouraged. This includes such things as an employee's departmental subject matter area of expertise, his or her work coordinates (including email address and government-issued telephone and cell phone number), his/her title and classification and views and/or opinions he/she would normally express in the course of fulfilling his/her duties.</li>\n<li>When a contribution is made, the user needs to be logged-in and GCconnex (Elgg) stores the contribution information which includes user name, and the date and time of the action.</li>\n</ul><p><br></p><p><strong>Usage</strong></p><p>In order for individuals to contribute content or view closed content, they are required to have a valid GCconnex account. The registration process requires the collection of certain personal information, namely user name, real name, and email address.</p><p><br></p><p><strong>Disclosure</strong></p><p>Individuals with access to the internal Government of Canada network (SC-Net) may be able to browse and read some content on GCconnex without the need to register depending on the privacy settings for each piece of content.</p><p>Your personal information is not shared, sold, rented, traded, or otherwise disclosed to any outside third party except with your consent or where authorized and or required by law.</p><p><br></p><p><strong>Retention</strong></p><p>Personal information is retained by GCconnex only so long as required by law or as is reasonable to fulfill the purposes for which it has been collected.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027145-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027145-en\"><div class=\"panel-heading\"> <h5>Is GCconnex open to Access to Information requests?</h5></div></a><div id=\"2100027145-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span>Note that GCconnex can be accessed by members of the public pursuant to an Access to Information request, by the Members of Parliament, the Senate and their staff in both the Government and Opposition, and that non-Government of Canada users may be invited to access GCconnex for special projects.<p><br></p>The GC Tools are your digital workplace. We hope you take as much pride in it as we do.<p><br></p><p>For any other questions regarding policies affecting GCconnex, please refer to the <a href=\"https://gcconnex.gc.ca/terms\">Terms and Conditions of Use</a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027148-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027148-en\"><div class=\"panel-heading\"> <h5>Can GCconnex be used by Crown corporations?</h5></div></a><div id=\"2100027148-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>Although it is true that GCconnex is readily available to departments with a “gc.ca” and \"canada.ca\" email, other organizations can still use GCconnex by accessing SCNet (SecureChannel). The “gc.ca” rule is not entirely accurate; there are many organizations, such as Crown corporations, that do not have emails that end in “gc.ca” but that are still connected to SCNet.</p><p><br></p><p>The cost of accessing SCNet is not technically or financially out of reach for most organizations. For more information, refer to a page explaining<a title=\"PWGSC ITS Product Catalogue/Secure Channel Network (SCNet)\" href=\"http://www.gcpedia.gc.ca/wiki/PWGSC_ITS_Product_Catalogue/Secure_Channel_Network_(SCNet)\">&nbsp;<u>Secure Channel</u></a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027147-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027147-en\"><div class=\"panel-heading\"> <h5>Which software does GCconnex run on?</h5></div></a><div id=\"2100027147-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><div rel=\"clipboard_data\"><p>GCconnex uses <a href=\"https://elgg.org/\"><u>Elgg</u></a>, open source social networking software that provides individuals and organizations with the components needed to create an online social environment.</p></div><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027261-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027261-en\"><div class=\"panel-heading\"> <h5>What is a GCTools Ambassador?</h5></div></a><div id=\"2100027261-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>A GCTools Ambassador is a volunteer from a government department or region who promotes GCconnex, Gcpedia, and GCcollab by providing support to departmental or regional teams in understanding how the GCTools can enhance their work.</p><p><br></p><p>In 2016-2017, the Ambassadors Network consisted of 240 ambassadors located in 50 departments and regions.</p><p><br></p><p><strong>The role of a GCTools Ambassador is to:</strong></p><ul>\n<li><p>Promote the GCTools within their organization, communities and across the Public Service</p></li>\n<li><p>Be willing to proactively seek out opportunities to promote the GCTools</p></li>\n<li><p>Relay the feedback you get from the audiences to us</p></li>\n<li><p>Build your own network of ambassadors within your organization (it is more fun if you aren’t doing it alone!)</p></li>\n</ul><p><br></p><p><strong>How to get involved:</strong></p><ul>\n<li><p>Obtain approval from your manager as being part of the GCTools Ambassadors Network will involve some of your time during business hours. Request to join the <a href=\"http://gcconnex.gc.ca/groups/profile/662668/ambassadors-network-for-the-gc20-tools-reseau-des-ambassadeurs-des-outils-gc20\"><u>GCconnex closed group</u></a></p></li>\n<li><p>Add your name to the <a title=\"GCTools Ambassadors/Find Ambassador\" href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors/Find_Ambassador\"><u>Ambassadors' list</u></a></p></li>\n<li><p>Register to one of the orientation sessions (see Event Calendar for dates and registration)</p></li>\n<li><p>Add the Ambassador badge to your GCconnex avatar</p></li>\n<li><p>Add the GC Tools Ambassador Userbox to your GCpedia profile.</p></li>\n</ul><p><br></p><p><strong>How to find an Ambassador:&nbsp;</strong>Refer to our <a href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors/Find_Ambassador\"><u>Find an Ambassador&nbsp;</u></a>page.</p><p><br></p><p><strong>No Ambassador in your organization?&nbsp;</strong>Contact our <span style=\"color: rgb(44, 130, 201);\"><u><a href=\"https://gcconnex.gc.ca/mod/contactform/\">Help Desk</a>.</u></span></p><p><br></p><p><strong>For more information, please see our<a href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors_Network\"><u>&nbsp;Ambassadors Network&nbsp;</u></a>page.</strong></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027339-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027339-en\"><div class=\"panel-heading\"> <h5>Is polling in GCconnex considered public opinion research (POR)?</h5></div></a><div id=\"2100027339-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>GCconnex does not make something POR or not, it is how it is used. It is entirely possible to use the polling feature on GCconnex in a manner that would be considered POR, as well as a manner that isn’t.</p><p><br></p><p>It is up to each user to ensure that they are using the tool in a way that is policy compliant, and if a potential use of the polling function would constitute POR they should seek the appropriate approvals with their departmental Communications.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027340-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027340-en\"><div class=\"panel-heading\"> <h5>Can we create groups on GCconnex that are for informal workplace activities?</h5></div></a><div id=\"2100027340-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>The rules that apply in the “offline” world apply in the “online” world.</p><p><br>Here is a rule of thumb: if you would make a reservation of a board/meeting room at work for your group, then you may create a group in GCconnex. If you would be comfortable using other \"work tools\" (emails, boardroom, etc.) provided by the employer to share the same information, without getting into trouble with your management, then GCconnex is perfectly fine. You’re just bringing the conversation somewhere else, on another work tool. &nbsp;For example: &nbsp;</p><ul>\n<li>&nbsp;Curling club that meets outside of work? No GCconnex group.&nbsp;</li>\n<li>&nbsp;Book club on work-related topics, OL practice during lunch? A GCconnex group is OK.</li>\n<li>&nbsp;Health and wellness activities (a meditation group for example) – even after-hours? Yes, if they are supported through internal committees or workplace initiatives.&nbsp;</li>\n</ul><p><strong><br>As long as the group is supported by the workplace.</strong></p><p><br>The permissible uses above of GCconnex would actually make a lot of sense, since this kind of group would be a great place to put the required resources that new members to your group would need to get started (instead of having to email them separately each time a new member joins), calendar items for lunchtime sessions (which would avoid email overload), and members would have the flexibility to share articles or other information related to the topic.</p><p><br></p><p>You may also use the <a href=\"http://www.tbs-sct.gc.ca/pol/doc-eng.aspx?section=text&amp;id=25049\" rel=\"nofollow\"><u>Code of Values and Ethics</u></a> as a guide.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027341-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027341-en\"><div class=\"panel-heading\"> <h5>What about colleagues who have left (retired or elsewhere)? Should we delete their profile?</h5></div></a><div id=\"2100027341-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>In GCconnex, if we delete an account, everything that person did is lost.</p><p><br></p><p>Don’t forget, even if someone leaves the public service for a while, it doesn’t mean they are never coming back (students for example). By keeping their profile, we allow them to start where they have left off. Also, the content in a retired colleague’s profile can still be relevant and useful. Deleting the profile would delete this useful information… &nbsp;</p><p><br></p><p>In the case of someone who leaves – for good or for a while – we suggest (until we find a solution for this) that they post that they are retired or have left in a <a href=\"http://www.gcpedia.gc.ca/gcwiki/images/5/54/EN_How_to_Create_A_Great_Profile_and_Manage_Widgets_on_GCconnex.pdf\" rel=\"nofollow\"><u>customized widget</u></a>.&nbsp;</p><p><br></p><p>To keep activity to a minimum:</p><dl><dd><dl><ul>\n<li><dd>Delete all contact info and add a note in your description that you have left the public service</dd></li>\n<li><dd>Remove your avatar&nbsp;</dd></li>\n<li><dd>Remove all your colleagues OR (if you know you will be back) turn of all Notifications</dd></li>\n<li><dd>Leave all of the groups you are a member of OR (if you know you will be back) turn off all Group Notifications</dd></li>\n<li><dd>If you are the <strong>admin of a group</strong>, ask the owner to transfer the admin powers to another member of the group</dd></li>\n<li><dd>If you are the <strong>owner of a group</strong>, transfer the ownership to another member of your group</dd></li>\n</ul></dl></dd></dl><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027345-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027345-en\"><div class=\"panel-heading\"> <h5>Can my team use a generic e-mail for our group on GCConnex?</h5></div></a><div id=\"2100027345-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span>GCconnex is a professional social networking platform where human connections and trust are key. People relate more to (and interact more with) individuals than to (with) generic mailbox. This is why we strongly encourage you to have an individual as the owner of a group.&nbsp;<p><br></p><p>This being said, we understand that in some cases (if your group serves as an intranet-type of communications), you will want to share the responsibilities that come with community management.</p><p>Here is an option: assign as many group operators as you want. They have the exact same administrative rights as the group owner (except for deleting the group).&nbsp;</p><p><br></p><p>Still not convinced? If you decide to use a generic email for your group, make sure it’s clear who is behind it. Do like big companies do on Twitter for example: add the initial of the person communicating/responding with the generic persona (ex: ^AL)</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027346-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027346-en\"><div class=\"panel-heading\"> <h5>What is the difference between a group blog and group discussion?</h5></div></a><div id=\"2100027346-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p>A <strong>group blog</strong> is meant for when you want to share your thoughts on something or information on a topic. Compared to a discussion thread, it’s closer to a one-sided communications feature. Your readers might comment, and that is a good thing. The objective of the blog is not necessarily to get feedback (although, you probably will). Blogs usually include a call to action or a “stake in the ground” giving information what this group is about: sign-up for this! Register to that! Tell me what you think! Donate! Blogs are available in groups or in individual profiles, which means you can blog in a personal fashion.&nbsp;</p><p><br></p><p>A <strong>group discussion</strong>, on the other hand, is meant to be a two-sided communications feature. Here, you want to receive answers! Any member of a group can post a discussion topic, give context, ask questions. Group members will reply to the original question, or to comments made by others in response to the original question. It then becomes a continuous back and forth discussion of the group members’ ideas, opinions, questions and interpretations of the topic at hand.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027363-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027363-en\"><div class=\"panel-heading\"> <h5>I receive too many notifications. What can I do?</h5></div></a><div id=\"2100027363-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About GCconnex</span><p><br></p><ul>\n<li>Try our new GCconnex <strong>notifications digest</strong>.The notifications digest can be used to receive a daily or weekly email that provides a summary of the activities to which you are subscribed. Hover over your \"Notifications\" link at the top of every page and click on the gear icon. Enable your notifications digest!</li>\n<li>Turn off some of your Group Notifications. Keep the notifications on for the group that most interest you. For the others, go back and visit them once in a while to see what has happened. Go to <em>Settings</em>, and then <em>Group notifications</em>. For more on how to set your group notifications, check out the <a href=\"http://www.gcpedia.gc.ca/wiki/Tutorials_on_GC2.0_Tools_/_Tutoriels_sur_les_outils_GC2.0/GCconnex\" rel=\"nofollow\"><u>tutorials here</u></a>.</li>\n<li>You may also choose to turn off notifications for your colleagues’ activity. You can turn the notifications off in bulk, or customize per colleague. Go to <em>Settings</em>, and then <em>Notifications</em>. For more on how to set your colleagues notifications, check out the <a href=\"http://www.gcpedia.gc.ca/wiki/Tutorials_on_GC2.0_Tools_/_Tutoriels_sur_les_outils_GC2.0/GCconnex\" rel=\"nofollow\"><u>tutorials here</u></a>.</li>\n<li>OR: Keep the notifications on, but sort messages as they arrive in your Inbox! Set an automated rule in Outlook that will send all email notifications from GCconnex to a specific folder, therefore you can create a rule that applies specifically to that e-mail address.</li>\n<li>Check the blog post <a href=\"http://gcconnex.gc.ca/blog/view/5542007/filtering-gcconnex-mail-notifications-for-groups\" rel=\"nofollow\"><u>Filtering GCconnex Mail Notifications for Groups</u></a> by Dave Sampson.&nbsp;</li>\n</ul><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div></div> </div><div class=\"folder\"><a href=\"#2100029511-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029511-en\"><div class=\"\"> <h4>About the GCTools</h4></div></a><div id=\"2100029511-en\" class=\"collapse\"><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027348-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027348-en\"><div class=\"panel-heading\"> <h5>What are the rules regarding Official Languages?</h5></div></a><div id=\"2100027348-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span><p>The same rules apply on the GCTools that apply in any other aspect of your work. If there is a document or information that you normally would have translated if distributing by e-mail or hardcopies in person, then you should do so if posting to the GCTools are not meant to be used to circumvent your official languages obligations, all the same policies apply online as they do in the offline world. &nbsp;</p><p><br></p><p>Determining your target audience is important. People should manage the content they post to the GCTools as if it were an email or a contribution in a meeting. In some meetings, members agree to work in French only or in English only. This is something you have the right to decide as a committee. It might be important (or mandatory) that documents or messages be available in both official languages, for example when conducting a government-wide consultation.</p><p><br></p><p>Employees are free to contribute in the language of their choice in all aspects of their work, including on the GCTools. That means that if you have a French page/section and an English page/section that are asking for people to provide comments or feedback, they will never be the mirror of one another. And that is acceptable. There is no obligation to have the “work-in-progress” translated. The end product should however be made available in both official languages.</p><p><br></p><p>Be aware as well that not all public servants have the same official languages obligations. For example, some organizations are unilingual depending on the region they are based out of. In these circumstances, all the content they might post to the GCTools would be in one language only. Again, the same rules that apply offline also apply online.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027349-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027349-en\"><div class=\"panel-heading\"> <h5>Is the content of the GCTools “ATIPable”?</h5></div></a><div id=\"2100027349-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span>Yes, as is everything we do or use in the public service.<p><br></p>You will never receive a question like “I want to know what has been done on file X in GCpedia”. Instead, an Access to Information request is probably going to have a question like “I want to know what has been done on file X”. Then you would have to go through your emails, paper documents (even your own personal hand written notes), filing cabinet, electronic document system, AND the GCTools. They are another place to verify on the checklist.&nbsp;<p><br></p><p>Don’t forget, if any content on GCpedia, GCconnex, or GCcollab has business value or led to business value or decisions, it should have been saved in your official repository, as stipulated in our <span data-hasqtip=\"0\">IM</span> guidelines and policies. Therefore, that content would already be in an ”ATIPable” tool.&nbsp;</p><p><br></p><p>GCpedia, GCconnex, and GCcollab are meant for transitory information, idea generation, or for sharing purpose. They are not official repositories.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027357-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027357-en\"><div class=\"panel-heading\"> <h5>Who has ownership of the content?</h5></div></a><div id=\"2100027357-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span>Each individual employee is responsible for what she or he posts. If the post were to be inappropriate or violate the terms and conditions of use of the GCTools a group administrator would not be held responsible.<p><br></p>However, good practice for group administrators is to actively moderate and monitor comments and activity within your group. You are also free to have your own rules of engagement for a group that you administer.<p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027358-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027358-en\"><div class=\"panel-heading\"> <h5>Who ensures accuracy on content?</h5></div></a><div id=\"2100027358-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span>Sharing incorrect or outdated information can happen anywhere, not just on the GCTools.&nbsp;<p><br></p><p>As employees communicate and collaborate, it becomes much easier to spot mistakes, pieces of misinformation, and other inaccuracies. In theory, the more we all use GCpedia, GCconnex, and GCcollab, the more likely the information there will be more up-to-date and relevant than information we find in more traditional sources (as Wikipedia has proven to us in the world of encyclopaedias!).&nbsp;</p><p><br></p><p>If you have doubts about the accuracy, we encourage you to edit the page or start a conversation about it. Trust your instinct, and confirm with a reliable source. Then edit the page for the benefit of other users. In case of disagreement with the original author, don’t get into &nbsp;a “flame war”. Do as you would do during a meeting or an informal conversation in the kitchen: agree to disagree.</p><p>&nbsp;</p><p>People will understand that any content on the tool is not from an authoritative source and should be taken as is it: a work in progress.&nbsp;</p><p><br></p><p>The GCTools team does not centrally monitor content posted on GCpedia, GCconnex, GCcollab. All teams or committees have to set their own engagement rules as to who will monitor content posted within their groups or pages.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027362-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027362-en\"><div class=\"panel-heading\"> <h5>How can I learn about the history of the GCTools?</h5></div></a><div id=\"2100027362-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span>Information on the <a title=\"GCTools/What are the GCTools\" href=\"http://www.gcpedia.gc.ca/wiki/GCTools/What_are_the_GCTools\"><u>GCTools</u></a> is available on GCpedia, along with <a title=\"GCTools/Resources/Communication Products\" href=\"http://www.gcpedia.gc.ca/wiki/GCTools/Resources/Communication_Products\"><u>resources and communication products</u></a> that provide information on the history of the GCTools.<p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027369-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027369-en\"><div class=\"panel-heading\"> <h5>Will access to the GCTools from personal devices be available in the future?</h5></div></a><div id=\"2100027369-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span>The GCTools team is currently looking into enabling secure access from personal devices. This is a common user request.<p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027370-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027370-en\"><div class=\"panel-heading\"> <h5>Why open source software?</h5></div></a><div id=\"2100027370-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span><ul>\n<li>Access to code and applications is easy (no procurement process, no licensing costs).</li>\n<li>They are easy to install.</li>\n<li>There is very little investment involved. Installing new modules is made easy and flexible.</li>\n</ul><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027382-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027382-en\"><div class=\"panel-heading\"> <h5>What is a GCTools Ambassador?</h5></div></a><div id=\"2100027382-en\" class=\"collapse panel-body\"><span>About the GCTools &gt; About the GCTools</span>\n<p>A GCTools Ambassador is a volunteer from a government department or region who promote GCpedia, GCconnex, and GCcollab by providing support to departmental or regional teams in understanding how the GCTools can enhance their work.</p>\n<p><br></p>\n<p>In 2016-2017, the Ambassadors Network consisted of 240 ambassadors located in 50 departments and regions.</p>\n<p><br></p>\n<p><strong>The role of a GCTools Ambassador is to:</strong></p>\n<ul>\n<li><p>Promote the GCTools within their organization, communities and across the Public Service\n</p></li>\n<li><p>Be willing to proactively seek out opportunities to promote the GCTools\n</p></li>\n<li><p>Relay the feedback you get from the audiences to us\n</p></li>\n<li><p>Build your own network of ambassadors within your organization (it is more fun if you aren’t doing it alone!)\n</p></li>\n</ul>\n<p><br></p>\n<p><strong>How to get involved:</strong></p>\n<ul>\n<li><p>Obtain approval from your manager as being part of the GCTools Ambassadors Network will involve some of your time during business hours. Request to join the <a href=\"http://gcconnex.gc.ca/groups/profile/662668/ambassadors-network-for-the-gc20-tools-reseau-des-ambassadeurs-des-outils-gc20\"><u>GCconnex closed group</u></a>\n</p></li>\n<li><p>Add your name to the <a title=\"GCTools Ambassadors/Find Ambassador\" href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors/Find_Ambassador\"><u>Ambassadors' list</u></a>\n</p></li>\n<li><p>Register to one of the orientation sessions (see Event Calendar for dates and registration)\n</p></li>\n<li><p>Add the Ambassador badge to your GCconnex avatar\n</p></li>\n<li><p>Add the GC Tools Ambassador Userbox to your GCpedia profile.\n</p></li>\n</ul>\n<p><br></p>\n<p><strong>How to find an Ambassador:&nbsp;</strong>Refer to our <a href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors/Find_Ambassador\"><u>Find an Ambassador&nbsp;</u></a>page.</p>\n<p><br></p>\n<p><strong>No Ambassador in your organization?&nbsp;</strong>Contact our <a href=\"https://gccollab.ca/mod/contactform/\"><u>Help Desk</u></a>.</p>\n<p><br></p>\n<p><strong>For more information, please see our<a href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors_Network\"><u>&nbsp;Ambassadors Network&nbsp;</u></a>page.</strong></p>\n<p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div></div> </div></div> </div><div class=\"article-cat\"><a href=\"#2100018917-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018917-en\"><div class=\"\"> <h3>FAQs</h3></div></a><div id=\"2100018917-en\" class=\"collapse\"><div class=\"folder\"><a href=\"#2100029398-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029398-en\"><div class=\"\"> <h4>Overview</h4></div></a><div id=\"2100029398-en\" class=\"collapse\"><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027350-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027350-en\"><div class=\"panel-heading\"> <h5>What type of documents/information can we post/share on the GCTools?</h5></div></a><div id=\"2100027350-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Since the GCTools are on a Government of Canada <strong>internal</strong> network, employees should follow the same rules as if they were sending a document by email.&nbsp;</p><p><br></p><p>As the GCTools are not on a secure network, you should not post any content rated above Protected A. Making a document or information “private” or for “group members” only in GCconnex or GCollab doesn’t allow you to circumvent this requirement.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027351-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027351-en\"><div class=\"panel-heading\"> <h5>Are the GCTools accessible to employees with disabilities?</h5></div></a><div id=\"2100027351-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span>Public servants who make use of screen readers and other assistive devices are able to successfully use GCpedia, GCconnex, and GCcollab.<p><br></p><p>As administrators, the GCTools Team is making all possible efforts to ensure that the Tools are can be accessed and used by all users.&nbsp;</p><p><br></p><p>The GCTools Team partnered with Statistics Canada to do accessibility testing on GCconnex. While GCconnex received a relatively high compliance score, Stats Can identified a number of areas that we can address to improve the accessibility of the site. With the help of Stats Can, our technical team implemented a number of key accessibility improvements during the Spring of 2015.&nbsp;</p><p><br></p><p>As a <em>contributor</em>, you should ensure that the content you post to the GCTools is done in a manner that is as accessible as possible to all users. Be conscious of the fact that some specialized formatting or media types may significantly increase the risk of accessibility issues.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027354-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027354-en\"><div class=\"panel-heading\"> <h5>Is there duplication with GCDocs?</h5></div></a><div id=\"2100027354-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>No. GCDOCS is an official repository for information of business value. GCpedia, GCconnex, and GCcollab are for transitory information.&nbsp;</p><p><br></p><p>If content is posted on GCpedia for sharing with people from other departments is of business value, it should also have been saved in your departmental document repository first.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027356-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027356-en\"><div class=\"panel-heading\"> <h5>Why can’t I use a pseudonym on the GCTools?</h5></div></a><div id=\"2100027356-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>The GCTools are professional networking and collaborative platforms. Collaboration is based on trust and we should all be easily identifiable. Don’t forget that your user profile is linked to your email address, and that your full user name (usually RealFirstName.RealLastName) appears anyway in the address bar; Therefore, there is no point in trying to hide behind a screen name.&nbsp;</p><p><br></p><p>When you register, you have to accept the Terms and Conditions. Using your real name is part of the conditions you agree to when signing-up.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027359-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027359-en\"><div class=\"panel-heading\"> <h5>What happens if employees post inappropriate or rude content?</h5></div></a><div id=\"2100027359-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span>It is very rare that any inappropriate content is posted to the GCTools, in part because we do not allow anonymous posting.<p><br></p>Remember, just because you might not agree with a comment, it doesn’t mean it is inappropriate. However, if you see content that violates our terms and conditions of use for the GCTools, please notify <a href=\"mailto:admin.GCPEDIA@tbs-sct.gc.ca?subject=flag%20of%20inappropriate%20content%20or%20behaviour&amp;body=If%20you%20believe%20that%20content%20or%20behaviour%20violates%20the%20terms%20of%20use,%20please%20provide%20a%20description%20of%20the%20inappropriate%20behaviour%20or%20content,%20the%20name%20of%20the%20person%20implicated,%20and%20the%20hyperlinks%20if%20possible.%20The%20content%20or%20behaviour%20will%20be%20reviewed.\" rel=\"nofollow\"><u>the GCTools team</u></a> and we will take appropriate action as warranted to either contact the individual who created the content and/or to remove the content.<p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027360-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027360-en\"><div class=\"panel-heading\"> <h5>Storing or distributing documents: should I use GCconnex or GCpedia?</h5></div></a><div id=\"2100027360-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>If you want to share documents openly to <strong>all public servants or in a visually structured way</strong>, GCpedia is probably better if you are comfortable with creating pages in MediaWiki (you can also reuse code from pages you like to make it easier!).&nbsp;</p><p><br></p><p>If the documentation is shared through a <strong>working group/committee</strong>, then GCconnex is probably better. Members will look for files in a folder format the same way as they would do in a regular computer drive system.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027361-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027361-en\"><div class=\"panel-heading\"> <h5>Our department already has SharePoint (or another collaboration tool). Should we still use the GCTools?</h5></div></a><div id=\"2100027361-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Yes! Sometimes the departmental tools will be the right tools, sometimes the GCTools will be the appropriate tools. It all depends on what you are doing and who you are trying to reach.</p><p><br></p><p>Departmental collaboration tools <strong>do not</strong> allow for interdepartmental collaboration. The GCTools are free for departments to use and are the only tools available to share information and collaboration with federal government employees across all public service, in all regions.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027368-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027368-en\"><div class=\"panel-heading\"> <h5>Am I able to access the GCTools from home?</h5></div></a><div id=\"2100027368-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span>The GCpedia and GCconnex are available from the Government of Canada network only. Therefore, if you can access this network from home, via VPN to your departmental network or a government-issued Blackberry, you can access them. You can access GCcollab at home since it is available outside of the Government of Canada network.<p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a class=\"head-toggle\" href=\"#2100027371-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027371-en\"><div class=\"panel-heading\"> <h5>What is simplified sign-on?</h5></div></a><div id=\"2100027371-en\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Simplified Sign-on allows users to log in to GCpedia and GCconnex simultaneously.</p><p><br></p><p>First, you have to link your GCpedia and GCconnex accounts (you only do this once). Once your accounts are linked, when you log in to GCconnex you will automatically be logged in to GCpedia, and vice versa. When you’re logging from GCpedia, use the “Simplified Sign-on” button to take advantage of the Simplified Sign-on feature. &nbsp;<br><br></p><p>For more information, see the <a title=\"EN Simplified Sign-on Link your GCpedia and GCconnex Accounts.pdf\" href=\"http://www.gcpedia.gc.ca/gcwiki/images/c/c9/EN_Simplified_Sign-on_Link_your_GCpedia_and_GCconnex_Accounts.pdf\"><u>Simplified Sign-on tutorial.</u></a>&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div></div> </div></div> </div><div class=\"article-cat\"><a href=\"#2100018918-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018918-en\"><div class=\"\"> <h3>Help Material</h3></div></a><div id=\"2100018918-en\" class=\"collapse\"><div class=\"folder\"><a href=\"#2100029477-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029477-en\"><div class=\"\"> <h4>Get Started</h4></div></a><div id=\"2100029477-en\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029483-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029483-en\"><div class=\"\"> <h4>Content Management</h4></div></a><div id=\"2100029483-en\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029501-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029501-en\"><div class=\"\"> <h4>Collaboration and Networking</h4></div></a><div id=\"2100029501-en\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029502-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029502-en\"><div class=\"\"> <h4>Manage Account Settings</h4></div></a><div id=\"2100029502-en\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029559-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029559-en\"><div class=\"\"> <h4>Group Ownership and Management</h4></div></a><div id=\"2100029559-en\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029571-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029571-en\"><div class=\"\"> <h4>Widgets</h4></div></a><div id=\"2100029571-en\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029506-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029506-en\"><div class=\"\"> <h4>Jobs Marketplace</h4></div></a><div id=\"2100029506-en\" class=\"collapse\"></div> </div></div> </div><div class=\"article-cat\"><a href=\"#2100018919-en\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018919-en\"><div class=\"\"> <h3>User Engagement</h3></div></a><div id=\"2100018919-en\" class=\"collapse\"></div> </div>","fr":"<div class=\"article-cat\"><a href=\"#2100018753-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018753-fr\"><div class=\"\"> <h3>GCConnex</h3></div></a><div id=\"2100018753-fr\" class=\"collapse\"><div class=\"folder\"><a href=\"#2100028949-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100028949-fr\"><div class=\"\"> <h4>À propos des OutilsGC</h4></div></a><div id=\"2100028949-fr\" class=\"collapse\"><div class=\"panel help-article\"><a href=\"#2100027135-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027135-fr\"><div class=\"panel-heading\"> <h5>À propos</h5></div></a><div id=\"2100027135-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>GCconnex est une plateforme de collaboration professionnelle sociale qui permet aux fonctionnaires de se connecter via une expérience partagée, des connaissances, des groupes ou des intérêts. GCconnex n'est pas un remplacement pour Facebook, ou d'autres réseaux sociaux personnels.</p><p><br></p><p>Pour mieux apprendre et communiquer, inscrivez‑vous à <a href=\"https://gcconnex.gc.ca/register\">GCconnex</a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027149-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027149-fr\"><div class=\"panel-heading\"> <h5>Qui peut utiliser GCconnex?</h5></div></a><div id=\"2100027149-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Les utilisateurs sont libres d’utiliser GCconnex comme il leur convient, conformément au code de conduite de leurs organisations respectives.</p><p>&nbsp;</p><p>Les employés des ministères et des organismes fédéraux ayant un accès au Réseau de la Voie de communication protégée (VCP) peuvent accéder à GCcollab.</p><p><br></p><p>Pour mieux apprendre et communiquer, inscrivez‑vous à <a href=\"https://gcconnex.gc.ca/register\">GCconnex</a></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 1</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027152-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027152-fr\"><div class=\"panel-heading\"> <h5>Que peut-on faire avec GCconnex?</h5></div></a><div id=\"2100027152-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p><strong>Amélioration la dynamique d’équipe</strong></p><p>En ayant accès à GCconnex, les utilisateurs peuvent faire des suggestions, interagir ouvertement, soulever des problèmes et apporter des idées pour améliorer le milieu de travail. Les utilisateurs peuvent trouver des personnes qui partagent leurs idées et améliorer la collaboration, le réseautage et les meilleures pratiques tout en contribuant au renforcement des collectivités. De plus, en répondant aux demandes ou en développant leurs connaissances, ils peuvent donner libre cours à leurs passions, parfois en dehors des limites propres à leurs fonctions.</p><p><br></p><p><strong>Réunions réelles</strong></p><p>GCconnex peut aider à améliorer les réunions réelles, favoriser le travail et la collaboration sur les projets entre les réunions. Les réunions peuvent être remplacées en utilisant les fonctionnalités d’un groupe GCconnex ou d’un clavardoir.</p><p><br></p><p><strong>Partage de contenu</strong></p><p>GCconnex est l’endroit idéal pour faire l’ébauche, l’entreposage et la distribution des ordres du jour et des procès-verbaux en permettant le partage de ces documents ou outils et leur accès aux lieux de travail et aux régions. De plus, les utilisateurs peuvent télécharger des documents comme des présentations et de la documentation, permettant ainsi de tout conserver au même endroit. En utilisant les groupes de discussion, vous ne manquerez jamais un courriel, et les réponses à tous n’encombreront pas votre boîte de réception. De plus, vous garderez une trace de tous les changements et des intervenants.</p><p><br></p><p><strong>Contenu centralisé</strong></p><p>GCconnex peut être utilisé pour centraliser l’information et l’organisation d’un projet tout entier. En plus de stocker des notes de réunion et de fournir un espace de remue-méninges, il fournit un environnement ouvert pour l’organisation d’un projet en favorisant un dialogue constructif. En centralisant les principaux documents dans GCconnex et en encourageant la collaboration ouverte, le risque de perdre des documents importants dans une boîte de courriel quelconque ou de perdre des renseignements clés lorsqu’un intervenant quitte est réduit.</p><p><br></p><p><strong>Gestion de la connaissance et structure de votre équipe</strong></p><p>Tenir à jour l’information relative à l’équipe dans un groupe GCconnex permet aux nouveaux employés d’accéder facilement à cette information, éliminant ainsi des processus redondants, comme l’envoi, par une personne, d’un courriel contenant cette information. En raison de la manière dont le groupe fonctionne, il est facile pour une personne d’identifier ses nouveaux collègues, de leur envoyer des messages, de poser des questions au groupe et de prendre connaissance des discussions précédentes, etc. GCconnex peut devenir votre guichet unique d’information et de collaboration.</p><p><br></p><p>Il existe différentes façons de commencer. Voici quelques petites suggestions :</p><ul type=\"disc\">\n<li>\n<strong>Joignez-vous à un groupe</strong> et <strong>participez aux discussions du groupe</strong> – Vous y trouverez des personnes dont les idées correspondent aux vôtres et d’autres qui remettent en questions certaines de vos réflexions. Si vous décidez de poursuivre la conversation avec une seule personne, en lui donnant le statut de collègue, vous pourrez clavarder avec elle en temps réel ou recevoir des messages vous avisant de ses activités dans GCconnex ou même lui envoyer un message directement.</li>\n<li>\n<strong>Commentez les affichages sur <em>Le fil</em></strong> – Répondez à une question ou appuyez un commentaire avec l’icône du « pouce vers le haut ». Au début, vous pourriez vous sentir mal à l’air de vous exprimer en ligne, alors commencez tranquillement. Ce moyen d’expression deviendra une seconde nature si vous persévérez.</li>\n<li>\n<strong>Publiez sur <em>Le fil</em></strong> – Un article, un fait divers, une observation de 140 caractères ou moins (comme sur Twitter, mais réservé au GC). Vos publications permettront aux autres d’en apprendre davantage sur ce qui vous intéresse.</li>\n<li>\n<strong>Partagez vos pensées</strong> avec les groupes auxquels vous appartenez, ou écrivez un blogue et partagez-le.</li>\n<li>\n<strong>Posez des questions et répondez aux questions</strong> – N’ayez pas peur de poser des questions et de montrer ce que vous savez, partagez votre expertise.</li>\n</ul><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027154-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027154-fr\"><div class=\"panel-heading\"> <h5>Ai-je besoin d’une permission pour utiliser GCconex?</h5></div></a><div id=\"2100027154-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Non. Il n’est PAS nécessaire d’obtenir une permission pour accéder à GCconnex.</p><p>&nbsp;</p><p>Les fonctionnaires de la plupart des ministères et organismes fédéraux ont accès à GCconnex.</p><p><br></p><div rel=\"clipboard_data\"><p>Pour mieux apprendre et communiquer, inscrivez‑vous à <a href=\"https://gcconnex.gc.ca/register\"><u>GCconnex</u></a></p></div><p><br></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027153-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027153-fr\"><div class=\"panel-heading\"> <h5>Y a-t-il un coût lié à l’utilisation de GCconnex?</h5></div></a><div id=\"2100027153-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p><span lang=\"FR-CA\">Non. GCconnex peut être utilisé gratuitement par tous les fonctionnaires.</span></p><p><br></p><p></p><p>Pour mieux apprendre et communiquer, inscrivez‑vous à <a href=\"https://gcconnex.gc.ca/register\">GCconnex</a>.</p><span lang=\"FR-CA\"></span><p></p><p><br></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027150-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027150-fr\"><div class=\"panel-heading\"> <h5>Pourquoi est-il impossible de naviguer de manière anonyme? Pourquoi dois-je créer un compte? </h5></div></a><div id=\"2100027150-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p><span lang=\"FR-CA\">Malheureusement, il n’est pas possible de naviguer de manière anonyme dans GCconnex. Vous devez créer un compte.</span><span lang=\"FR-CA\"></span><span lang=\"FR-CA\">&nbsp;Tous les utilisateurs doivent être connectés, même pour naviguer.</span></p><p><br></p><p><span lang=\"FR-CA\">Tous les utilisateurs inscrits peuvent naviguer, réseauter, publier de l’information et collaborer.&nbsp;</span></p><p>&nbsp;</p><div rel=\"clipboard_data\"><p>Pour mieux apprendre et communiquer, inscrivez‑vous à <a href=\"https://gcconnex.gc.ca/register\"><u>GCconnex</u></a></p></div><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027176-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027176-fr\"><div class=\"panel-heading\"> <h5>Qu’est-ce que le Carrefour d’emploi?</h5></div></a><div id=\"2100027176-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p><a href=\"https://gcconnex.gc.ca/groups/profile/7617072/\"><u>Le Carrefour d’emploi</u></a> est un forum Internet destiné à toute la fonction publique créé dans <a href=\"https://gcconnex.gc.ca/\"><u>GCconnex</u></a>, qui permet aux employés de réseauter professionnellement dans tous les ministères. Le Carrefour d’emploi est conçu pour afficher des possibilités de <strong>mobilité au même niveau</strong> (p. ex., mutations à durée déterminée et indéterminée, détachements et affectations), ainsi que des <strong>emplois occasionnels</strong>, des possibilités d’emploi pour les <strong>étudiants</strong>, des <a href=\"https://gcconnex.gc.ca/groups/profile/15328959/micro-missions\"><strong><u>micro-missions</u></strong></a> et propose également une page de référence pour <strong>d’autres sources de talent</strong> que les gestionnaires et les professionnels des RH voudront peut-être explorer, y compris des <a href=\"https://gcconnex.gc.ca/groups/profile/10118612/central-repository-of-active-federal-public-service-pools-repertoire-central-de-bassins-actifs-au-sein-de-la-fonction-publique-federale\"><u>bassins actifs d’autres ministères</u></a>. En outre, le Carrefour d’emploi peut être utilisé comme un outil pour faciliter l’<strong>échange de postes</strong> dans des situations de réaménagement de l’effectif.<br><br>Le Carrefour d’emploi facilite la gestion des personnes en améliorant l’accès des gestionnaires aux répertoires d’employés motivés et prêts à relever de nouveaux défis. Il favorise également la mobilisation et le perfectionnement des employés ainsi que les discussions grâce aux occasions qu’il offre et à l’utilisation de l’outil lui-même.</p><p><br></p><p>Le Carrefour d’emploi propose un nouvel outil de maillage automatisé : la <a href=\"https://gcconnex.gc.ca/missions/main\"><strong><u>Plateforme de possibilités de ConneXions Carrière</u></strong></a>. Il s’agit d’un outil qui permet aux employés talentueux de trouver rapidement des possibilités de mobilité au même niveau (p. ex., micro-missions et échange de postes) et de perfectionnement professionnel (p. ex., mentorat et jumelage) à leur mesure en tirant parti du contenu des profils GCconnex des employés. Les employés sont encouragés à opter pour le perfectionnement professionnel et les occasions de mobilité au même niveau afin de profiter pleinement de cet outil.</p><p>Le Carrefour d’emploi est en cours d’amélioration afin de devenir un guichet unique qui permettra aux gestionnaires et aux employés de maîtriser de nouvelles fonctions pour la dotation, le ressourcement et le perfectionnement de la fonction publique. Visitez le Carrefour d’emploi régulièrement pour profiter des nouvelles fonctions et de l’information qui s’y trouve.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027169-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027169-fr\"><div class=\"panel-heading\"> <h5>Qu’est-ce que Le fil?</h5></div></a><div id=\"2100027169-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span>\n<p>Comme Twitter, <em>Le fil</em> est un microblogue qui permet aux utilisateurs de publier des messages d’au plus 140 caractères pour partager de l’information rapidement et facilement. Vous pouvez effectuer une recherche sur <em>Le fil</em> par mots-clics, mots-clés et @mentions. Vous recevrez un avis si un autre utilisateur vous étiquette dans un message sur <em>Le fil</em> ou dans une conversation, une discussion, des commentaires ou un blogue.</p><p><br></p>\n<p>Affichez un événement qui vous intéresse, faites la promotion de votre groupe ou posez des questions à la collectivité GCcollab. Écrivez sur<a href=\"https://gcconnex.gc.ca/thewire/all\"><em>&nbsp;Le fil</em></a><em>&nbsp;</em>dès aujourd’hui.</p>\n<p><br></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027159-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027159-fr\"><div class=\"panel-heading\"> <h5>Les gestionnaires ont-ils accès à des fonctions d’administrateur dans GCconnex?</h5></div></a><div id=\"2100027159-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Tous les utilisateurs qui créent un groupe dans GCconnex ou qui sont désignés comme administrateurs de groupe auront des privilèges d’administrateur pour ce groupe, comme les options de contenu, les membres et la visibilité.</p><p>En tant que responsable de groupe, vous pouvez définir les niveaux d’accès au contenu par défaut pour tous les utilisateurs ou seulement pour les membres du groupe. Bien que les problèmes de modération soient rares, les responsables de groupe peuvent également gérer le contenu au sein du groupe.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027144-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027144-fr\"><div class=\"panel-heading\"> <h5>Qu’en est-il des langues officielles? </h5></div></a><div id=\"2100027144-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span>Nous respectons la <em>Loi sur les langues officielles</em> et nous nous engageons à offrir toutes les fonctionnalités de GCconnex dans les deux langues officielles. Lorsque vous publiez du contenu, vous devez tenir compte de votre rôle au sein de votre organisation, de vos responsabilités professionnelles et de votre public cible. Nous recommandons que les contenus officiels et les contenus à vaste diffusion soient offerts dans les deux langues officielles à titre de pratique exemplaire.<p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027139-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027139-fr\"><div class=\"panel-heading\"> <h5>Quel est le niveau de sécurité de GCcollab?</h5></div></a><div id=\"2100027139-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Nous surveillons régulièrement le trafic du réseau pour déceler toute tentative non autorisée de télécharger ou de modifier des renseignements, ou de causer des dommages. Nous suivons de l’information sur le trafic de réseau, comme l’adresse du protocole Internet (IP) de l’ordinateur, la date et l’heure des visites, et les pages visitées. Nous ne faisons aucune tentative de lier l’information avec l’identité des personnes à moins d’avoir détecté une tentative d’endommager le site.</p><p>&nbsp;</p><p>Pour les fonctionnaires, seul le matériel classé Protégé A ou ayant une classification inférieure devrait être publié dans les outils du gouvernement du Canada.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027140-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027140-fr\"><div class=\"panel-heading\"> <h5>GCconnex est-il vulnérable aux renseignements inexacts? </h5></div></a><div id=\"2100027140-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Étant donné que tous les utilisateurs inscrits peuvent ajouter du contenu, la publication d’information biaisée, désuète ou incorrecte est évidemment possible. Nous vous encourageons à nous aider en corrigeant l’information, en validant le contenu et en fournissant des références utiles. Ainsi, l’exactitude générale de l’information se trouvant sur GCconnex s’améliore constamment.</p><p>&nbsp;</p><p>Chaque utilisateur qui publie du contenu doit maintenir son exactitude. Il n’existe aucun moyen pour faire appliquer des mesures en ce qui concerne l’exactitude. Nous devons considérer chaque personne comme capable de publier de l’information. Il convient toutefois de noter que tout utilisateur peut et doit corriger le contenu qu’il sait erroné. En tant que lecteur, vous devez utiliser votre jugement en ce qui concerne la crédibilité, l’actualité, la fiabilité et la précision de ce que vous lisez sur GCconnex.</p><p>&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027141-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027141-fr\"><div class=\"panel-heading\"> <h5>GCcollab est-il vulnérable aux vandals?</h5></div></a><div id=\"2100027141-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Comme dans tous les espaces de travail virtuels où les personnes sont invitées à participer et à apporter leur contribution, il existe le risque que quelqu’un perturbe le processus créatif ou sabote le produit en soi. Toutefois, il y a un certain nombre de mécanismes en place afin d’atténuer ces risques de même que des incitatifs visant à dissuader tout comportement inapproprié ou destructeur au sein de la collectivité de GCconnex.</p><p>&nbsp;</p><ol>\n<li><span lang=\"FR-CA\">Les utilisateurs de GCconnex doivent utiliser leur vrai nom et leur adresse de courriel professionnelle lors de leur inscription. Les pseudonymes ou les identifiants ne sont pas permis.</span></li>\n<li><span lang=\"FR-CA\">GCconnex est un outil de travail. Il est improbable qu’une personne risque sa réputation professionnelle pour commettre un méfait.&nbsp;</span></li>\n<li>\n<span lang=\"FR-CA\">Étant donné que tout ce qui se passe dans GCconnex est entièrement consigné et rattaché à un compte d’utilisateur unique, il est facile d’identifier toute personne qui sabote une page de GCconnex ou y publie du contenu inapproprié.</span><span lang=\"FR-CA\"></span>\n</li>\n</ol><p><br></p><p><span lang=\"FR-CA\">Lorsqu’ils utilisent GCconnex, les universitaires et les étudiants sont tenus de se comporter de façon responsable conformément au code de conduite administré par leurs établissements d’enseignement postsecondaire respectifs, alors que les fonctionnaires sont tenus de respecter le&nbsp;</span><a href=\"http://www.tbs-sct.gc.ca/pol/doc-fra.aspx?id=25049\" rel=\"nofollow\"><span><span lang=\"FR-CA\"><span>Code de valeur et d’éthique du secteur public</span></span></span></a><span lang=\"FR-CA\">.&nbsp;</span></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027143-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027143-fr\"><div class=\"panel-heading\"> <h5>Que se passe-t-il si quelqu’un publie de l’information inappropriée sur GCconnex?</h5></div></a><div id=\"2100027143-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p><span lang=\"FR-CA\">La totalité du contenu est sujette à la responsabilisation, car la date et l’heure de toutes les entrées sont automatiquement enregistrées et associées avec l’adresse de courriel valide du contributeur. Le contenu inapproprié peut être retiré très rapidement. Les participants qui trouvent du contenu inapproprié sur GCconnex sont encouragés à en aviser <span lang=\"FR-CA\"><a href=\"https://gcconnex.gc.ca/mod/contactform/\">l'équipe de GCTools</a></span></span><a href=\"http://gccollab.ca/mod/contactform/\" rel=\"nofollow\"><span lang=\"FR-CA\"><span></span></span></a><span lang=\"FR-CA\">. Si nécessaire, les administrateurs de GCconnex peuvent supprimer le contenu inapproprié et suspendre un compte d’utilisateur.</span></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027136-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027136-fr\"><div class=\"panel-heading\"> <h5>Modalités de protection de vos renseignements personnels sur GCconnex?</h5></div></a><div id=\"2100027136-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><h4><strong>Collecte</strong></h4><ul>\n<li>Tous les renseignements personnels sur GCconnex sont considérés comme étant fournis volontairement. Leur utilisation ou leur divulgation est régie par les droits d'accès, de correction et de protection des renseignements personnels énoncés dans la <em>Loi sur la protection des renseignements personnels</em>.&nbsp;</li>\n<li>Les utilisateurs de GCconnex sont avertis que les renseignements ou les contenus affichés sur un wiki, un blog ou un autre site collaboratif du gouvernement fédéral sont assujettis aux dispositions de la <em>Loi sur l'accès à l'information</em> et de la <em>Loi sur la protection des renseignements personnels</em>. Il est donc possible d'accéder à ces renseignements et de les divulguer en réponse à une demande en vertu de l'une de ces lois.&nbsp;</li>\n<li>Afin de garantir une protection maximale de la confidentialité, il est recommandé aux utilisateurs de ne pas afficher de renseignements personnels, tels que des photos, des adresses privées, des curriculum vitæ, ces renseignements étant ensuite accessibles à tous les utilisateurs. Cependant, la <em>Loi sur la protection des renseignements personnels</em> n'exige pas de protéger certains types de renseignements personnels ayant notamment trait aux postes et aux fonctions des fonctionnaires. Par conséquent, ce type de renseignements personnels peuvent être affichés et sont même encouragés. Un employé peut notamment mentionner son domaine de compétence au sein de son ministère, ses coordonnées professionnelles (y compris son adresse électronique, son numéro de téléphone fixe et cellulaire fourni par le gouvernement), son titre et sa classification, ainsi que les avis et les opinions qu'il exprimerait normalement dans le cadre de l'exercice de ses fonctions.&nbsp;</li>\n<li>L'utilisateur doit ouvrir une session pour faire une contribution, dont GCconnex emmagasinera les renseignements, y compris le nom d'utilisateur et l'heure et la date de la contribution.&nbsp;</li>\n</ul><p>&nbsp;</p><h4><strong>Utilisation</strong></h4><p>Pour pouvoir contribuer du contenu ou visualiser du contenu fermé, les personnes doivent posséder un compte GCconnex valide. Le processus d'inscription exige la collecte de certains renseignements personnels dont, notamment, le nom d'utilisateur, le nom réel et l'adresse électronique.&nbsp;</p><h4><strong>&nbsp;</strong></h4><h4><strong>Divulgation</strong></h4><p><span>Lorsque les paramètres de confidentialité des contenus le permettent, les personnes qui accèdent au réseau interne du gouvernement du Canada (SC-Net) peuvent consulter et lire le contenu de GCconnex sans avoir à s'inscrire.&nbsp;</span></p><p>Vos renseignements personnels ne sont ni communiqués, ni vendus, ni loués, ni échangés et ni divulgués à d'un tiers, à moins que vous donniez votre consentement et que la loi l'autorise ou l'exige.&nbsp;</p><p>&nbsp;</p><h4><strong>Conservation</strong></h4><p>Les renseignements personnels sont conservés par GCconnex uniquement le temps que l'exige la loi et assez longtemps pour répondre aux fins de la collecte.&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027145-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027145-fr\"><div class=\"panel-heading\"> <h5>GCconnex est-il ouvert aux demandes d’accès à l’information?</h5></div></a><div id=\"2100027145-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Oui, tout le contenu GCconnex est assujetti à la divulgation en vertu de la <a href=\"http://laws-lois.justice.gc.ca/fra/lois/A-1/\" rel=\"nofollow\"><em><span>Loi sur l’accès à l’information</span></em></a> et de la <a href=\"http://laws-lois.justice.gc.ca/fra/lois/P-21/index.html\" rel=\"nofollow\"><em><span>Loi sur la protection des renseignements personnels</span></em></a>.</p><p>&nbsp;</p><p>Prenez note que GCconnex peut être consulté par les membres du public, conformément à une demande d’accès à l’information, par les membres du Parlement, du Sénat et de leur personnel à la fois au gouvernement et dans l’opposition, et que les utilisateurs hors du gouvernement du Canada pourraient éventuellement être invités à accéder à GCconnex.</p><p>&nbsp;</p><p>Pour toute autre question concernant les politiques touchant GCconnex, rapportez-vous aux<a href=\"http://gccollab.ca/termes\" rel=\"nofollow\"></a><a href=\"https://gcconnex.gc.ca/terms\">&nbsp;Conditions d'utilisation</a>.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027148-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027148-fr\"><div class=\"panel-heading\"> <h5>GCconnex peut-il être utilisé par les sociétés d'état?</h5></div></a><div id=\"2100027148-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p><span lang=\"FR-CA\">Bien qu’il soit vrai que GCconnex est facilement accessible aux ministères avec une adresse de courriel « gc.ca » et « canada.ca », d’autres organisations peuvent également utiliser GCconnex en accédant au réseau VCP. La règle du « gc.ca » n’est pas tout à fait exacte, car il y a de nombreux organismes, tels que les sociétés d’État, qui n’ont pas de courriel terminant par « gc.ca », mais qui sont tout de même connectés au réseau VCP.</span></p><p><br></p><p><span lang=\"FR-CA\">Pour la plupart des organismes, le coût de l’accès au réseau </span><a href=\"http://www.gcpedia.gc.ca/wiki/Product_catalogue/Secure_Channel_Network_(SCNet)\"><span lang=\"FR-CA\">VCP</span></a><span lang=\"FR-CA\"> n’est pas hors de portée sur le plan technique ou financier.</span></p><p>&nbsp;</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027147-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027147-fr\"><div class=\"panel-heading\"> <h5>Quel logiciel est utilisé pour exécuter GCconnex?</h5></div></a><div id=\"2100027147-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><span lang=\"FR-CA\">GCconnex utilise&nbsp;</span><a href=\"https://elgg.org/\" rel=\"nofollow\"><span><span lang=\"FR-CA\"><span>Elgg</span></span></span></a><span lang=\"FR-CA\">, un logiciel de réseautage de source ouverte qui offre aux personnes et aux organismes les composants nécessaires pour créer un environnement social en ligne.&nbsp;</span><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027261-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027261-fr\"><div class=\"panel-heading\"> <h5>Qu’est-ce qu’un ambassadeur OutilsGC?</h5></div></a><div id=\"2100027261-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Un ambassadeur OutilsGC est un bénévole d’un ministère ou d’une région qui fait la promotion de GCconnex, GCpédia et GCcollab en offrant du soutien aux équipes ministérielles ou régionales pour leur faire comprendre comment les OutilsGC peuvent améliorer leur travail.</p><p>En 2016-2017, le réseau comptait 240 ambassadeurs provenant de 50 ministères ou régions.</p><p><br></p><p><strong>Le rôle d’un ambassadeur OutilsGC est :</strong></p><ul type=\"disc\">\n<li>de faire la promotion des OutilsGC au sein de son organisme, sa collectivité et à l’échelle de la fonction publique;</li>\n<li>d’être en mesure de rechercher de manière proactive les occasions de promouvoir les OutilsGC;</li>\n<li>de nous faire parvenir les commentaires obtenus durant les présentations;</li>\n<li>de bâtir un réseau d’ambassadeurs au sein de son organisme (c’est plus amusant si on n’est plus tout seul!).</li>\n</ul><p><strong>Comment vous impliquer :</strong></p><ul type=\"disc\">\n<li>vous devez tout d’abord obtenir l’approbation de votre supérieur puisque pour faire partie du réseau des ambassadeurs OutilsGC vous aurez besoin de temps pendant vos heures de travail;</li>\n<li>demandez à vous joindre au <a href=\"http://gcconnex.gc.ca/groups/profile/662668/ambassadors-network-for-the-gc20-tools-reseau-des-ambassadeurs-des-outils-gc20\">groupe fermé GCconnex</a>;</li>\n<li>ajoutez votre nom à la <a title=\"GCTools Ambassadors/Find Ambassador\" href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors/Find_Ambassador\">liste des ambassadeurs</a>;</li>\n<li>inscrivez-vous à une des séances d’orientations prévues (voir le calendrier pour les dates et les modalités d’inscription);</li>\n<li>ajoutez un écusson d’ambassadeur à votre avatar GCconnex;</li>\n<li>ajoutez la boîte d’utilisateur Ambassadeur OutilsGC à votre profil GCpédia.</li>\n</ul><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027339-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027339-fr\"><div class=\"panel-heading\"> <h5>Les sondages dans GCconnex sont-ils considérés comme de la recherche sur l’opinion publique (ROP)?</h5></div></a><div id=\"2100027339-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Il est tout à fait possible d’utiliser dans GCconnex la fonction de sondage d’une manière qui serait considérée ou pas comme de la ROP.</p><p><br></p><p>Il appartient à chaque utilisateur d’utiliser l’outil d’une façon conforme à la politique et, si une utilisation éventuelle de la fonction de sondage devait constituer de la ROP, ils doivent demander les approbations nécessaires à leurs Communications ministérielles.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027340-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027340-fr\"><div class=\"panel-heading\"> <h5>GCconnex peut il servir à créer des groupes qui sont pour des activités officieuses du lieu de travail?</h5></div></a><div id=\"2100027340-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>En règle générale : si vous réserveriez une salle de réunion pour votre groupe, alors vous pouvez créer un groupe dans GCconnex. Si vous êtes à l’aise avec l’utilisation d’autres « outils de travail » (courriels, salle de conférence, etc.) fournis par l’employeur pour partager la même information, alors GCconnex fait parfaitement l’affaire. Par exemple :</p><ul type=\"disc\">\n<li>Club de lecture sur des sujets se rapportant au travail pendant le déjeuner? Un groupe GCconnex est parfait pour cela.</li>\n<li>Activités de santé et de mieux-être (un groupe de méditation, par exemple) – même après les heures? Oui, si elles ont l’appui de comités internes ou sont le fruit d’initiatives du milieu de travail.</li>\n</ul><p><br></p><p><strong>Un groupe est permis s’il a l’appui du milieu de travail.</strong> Les groupes ci‑dessus seraient un excellent endroit pour mettre les ressources dont les nouveaux membres auraient besoin pour débuter, de même que les sujets de discussion au déjeuner, et permettre ainsi aux membres de partager des articles et d’autres informations concernant le sujet.</p><p>Le <a href=\"http://www.tbs-sct.gc.ca/pol/doc-fra.aspx?id=25049\"><u>Code de valeurs et d’éthique</u></a> peut vous servir de guide.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027341-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027341-fr\"><div class=\"panel-heading\"> <h5>Devrions-nous supprimer le profil des collègues qui ne sont plus là (partis à la retraite ou ailleurs)?</h5></div></a><div id=\"2100027341-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Si nous supprimons un compte de GCconnex, nous perdons toutes les contributions du titulaire du compte.</p><p><br></p><p>N’oubliez pas : si quelqu’un quitte la fonction publique pour un certain temps, cela ne signifie pas qu’il ne reviendra jamais. En conservant son profil, nous lui permettons de reprendre là où il a quitté. De même, le contenu du profil d’un collègue à la retraite peut être pertinent et utile. La suppression du profil ferait perdre cette information utile.</p><p><br></p><p>Si vous quittez la fonction publique définitivement, ou pour une période prolongée, pour garder l’activité au minimum :</p><ul type=\"disc\">\n<li>Supprimez toutes vos coordonnées et ajoutez une note dans votre description pour expliquer que vous avez quitté la fonction publique</li>\n<li>Supprimez votre avatar</li>\n<li>Supprimez tous vos collègues OU (si vous savez que vous allez revenir), bloquez toutes les <a href=\"https://gccollab.ca/login\">notifications</a>\n</li>\n<li>Quittez tous les groupes auxquels vous vous êtes joint OU (si vous savez que vous allez revenir), bloquez toutes les notifications de groupe</li>\n<li>Si vous êtes l’<strong>opérateur d’un groupe</strong>, demandez au propriétaire de transférer les pouvoirs d’administration à un autre membre du groupe</li>\n<li>Si vous êtes le <strong>propriétaire d’un groupe</strong>, transférez la propriété à un autre membre de votre groupe</li>\n</ul><p><strong>&nbsp;</strong></p><p>Lorsque quelqu’un part – pour de bon ou pour un certain temps – nous conseillons (d’ici que nous trouvions une autre solution) qu’il affiche qu’il est à la retraite ou a laissé un <a href=\"http://www.gcpedia.gc.ca/wiki/GCconnex_User_Help/Content_Management_and_Collaboration/How_Do_I_Configure_Widgets%3F\"><u>gadget logiciel personnalisé</u><u>.</u></a></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027345-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027345-fr\"><div class=\"panel-heading\"> <h5>Mon équipe peut-elle utiliser un courriel générique pour notre groupe sur GCConnex?</h5></div></a><div id=\"2100027345-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>GCconnex est une plateforme de maillage social professionnel où les connexions et la confiance sont la clé. On s’identifie plus facilement et on interagit davantage avec des personnes qu’avec une boîte aux lettres générique. C’est pourquoi nous vous encourageons vivement à désigner une personne comme propriétaire du groupe.</p><p><br></p><p>Cela dit, nous comprenons que, dans certains cas (si votre groupe sert de moyen de communication de type intranet), vous voudrez partager les responsabilités à venir avec la direction de la collectivité.</p><p>Voici une option : assignez le plus grand nombre d’opérateurs de groupe que vous voudrez. Ils ont exactement les mêmes tâches administratives que le propriétaire du groupe (sauf pour la suppression du groupe).</p><p><br></p><p>Toujours pas convaincu? Si vous décidez d’utiliser un courriel générique pour votre groupe, précisez clairement qui en a pris l’initiative et mettez un processus en place pour partager le compte entre les opérateurs. Faites comme les grandes sociétés sur Twitter, par exemple : ajoutez l’initiale de la personne qui échange avec la personne générique (ex. : ^AL).</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027346-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027346-fr\"><div class=\"panel-heading\"> <h5>Quelle est la différence entre un blogue de groupe et une discussion de groupe?</h5></div></a><div id=\"2100027346-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><p>Le <strong>blogue de groupe</strong> sert à partager vos réflexions sur quelque chose ou de l’information sur un sujet. Comparé à un fil de discussion, il ressemble davantage à une fonction de communication à sens unique. Vos lecteurs pourraient envoyer leurs commentaires, et c’est une bonne chose. L’objectif du blogue n’est pas nécessairement de recueillir de la rétroaction (mais vous en aurez probablement quand même). Les blogues comprennent habituellement un appel à l’action ou une « pose de jalons » qui donne de l’information sur l’objet du groupe : Abonnez-vous à ceci! Inscrivez-vous à cela! Dites-moi ce que vous en pensez! Faites un don! Les blogues sont disponibles dans les groupes ou dans les profils individuels, de sorte que vous pouvez avoir un blogue personnel.</p><p><br></p><p>La <strong>discussion de groupe</strong>, par contre, se veut un moyen de communication dans les deux sens. Ici, vous voulez des réponses! Tout membre d’un groupe peut afficher un sujet de discussion, donner du contexte et poser des questions. Les membres du groupe répondront à la question initiale, ou aux commentaires qu’elle aura suscités. Cela devient un dialogue continu entre les membres du groupe sur leurs idées, leurs opinions, les questions et les interprétations du sujet discuté.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027363-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027363-fr\"><div class=\"panel-heading\"> <h5>Je reçois trop de notifications. Que puis je faire?</h5></div></a><div id=\"2100027363-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; À propos des OutilsGC</span><div rel=\"clipboard_data\"><ul type=\"disc\">\n<li>Essayez notre nouveau <strong>résumé des notifications</strong>. Le résumé des notifications peut servir à recevoir un courriel quotidien ou hebdomadaire donnant un sommaire des activités auxquelles vous vous êtes abonné. Placez votre curseur sur le lien « Notifications » en haut de chaque page, puis cliquez sur l’icône de l’engrenage. Activez votre résumé des notifications!</li>\n<li>Bloquez une partie de vos notifications de groupe. Ne gardez que celles pour le groupe qui vous intéresse le plus. Pour les autres, visitez-les de temps à autre pour voir s’il y a du nouveau. Allez à <em>Paramètres</em>, puis à <em>Notifications de groupe</em>. Pour en savoir davantage sur la façon de paramétriser les notifications de groupe, consultez les <a href=\"http://www.gcpedia.gc.ca/wiki/Tutorials_on_GC2.0_Tools_/_Tutoriels_sur_les_outils_GC2.0/GCconnex\"><u>tutoriels ici</u></a>.</li>\n<li>Vous pourriez choisir aussi de bloquer les notifications pour l’activité de vos collègues. Vous pouvez bloquer les notifications globalement, ou par collègue. Allez à <em>Paramètres</em>, puis à <em>Notifications</em>. Pour en savoir davantage sur la façon de paramétriser les notifications de vos collègues, consultez les <a href=\"http://www.gcpedia.gc.ca/wiki/Tutorials_on_GC2.0_Tools_/_Tutoriels_sur_les_outils_GC2.0/GCconnex\"><u>tutoriels ici</u></a>.</li>\n<li>OU : Gardez les notifications, mais triez les messages au fur et à mesure de leur arrivée dans votre boîte de réception! Établissez une règle automatisée dans Outlook pour faire envoyer toutes les notifications par courriel de GCconnex à un dossier donné, de sorte que vous pourrez créer une règle qui s’applique spécifiquement à cette adresse de courriel.</li>\n<li>Lisez le billet de blogue <a href=\"http://gcconnex.gc.ca/blog/view/5542007/filtering-gcconnex-mail-notifications-for-groups\"><u>Filtering GCconnex Mail Notifications for Groups</u></a> de Dave Sampson.</li>\n</ul></div><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div></div> </div><div class=\"folder\"><a href=\"#2100029511-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029511-fr\"><div class=\"\"> <h4>About the GCTools</h4></div></a><div id=\"2100029511-fr\" class=\"collapse\"><div class=\"panel help-article\"><a href=\"#2100027348-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027348-fr\"><div class=\"panel-heading\"> <h5>Quelles sont les règles concernant les langues officielles?</h5></div></a><div id=\"2100027348-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><p>Les OutilsGC sont assujettis aux mêmes règles que tout autre aspect de votre travail. Si vous avez un document ou de l’information que vous feriez normalement traduire pour une distribution par courriel ou sur papier en personne, vous devriez le faire traduire. L’affichage dans les OutilsGC n’est pas un moyen de contourner vos obligations en matière de langues officielles, et les mêmes politiques s’appliquent en ligne qu’ailleurs.</p><p><br></p><p>Il est important de cerner votre groupe cible. Il faut gérer le contenu que vous versez dans les OutilsGC comme s’il s’agissait d’un courriel ou d’une contribution à une réunion. Dans certaines réunions, les participants conviennent de travailler en français seulement ou en anglais seulement. C’est une chose que vous avez le droit de décider en comité. Il pourrait être important (voire obligatoire) que les documents ou les messages soient dans les deux langues officielles, par exemple lors d’une consultation à l’échelle du gouvernement.</p><p><br></p><p>Les employés sont libres d’utiliser la langue de leur choix dans tous les aspects de leur travail, y compris dans les OutilsGC. Cela signifie qu’une page/section française et une page/section anglaise qui demandent des commentaires ou de la rétroaction ne seront pas forcément le reflet fidèle l’une de l’autre. Et c’est acceptable. Il n’est pas obligatoire de faire traduire les « travaux en cours ». Le produit final devrait, par contre, être dans les deux langues officielles.</p><p>Sachez aussi que les fonctionnaires n’ont pas tous les mêmes obligations en matière de langues officielles. Par exemple, certaines organisations sont unilingues, selon la région où elles sont basées. Dans ces circonstances, tout le contenu qu’elles pourraient verser dans les OutilsGC serait unilingue. Encore une fois, les règles sont les mêmes pour la diffusion en ligne ou ailleurs.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027349-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027349-fr\"><div class=\"panel-heading\"> <h5>Le contenu des OutilsGC est il soumis à l’AIPRP?</h5></div></a><div id=\"2100027349-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><p>Oui, comme tout ce que nous faisons ou utilisons dans la fonction publique.</p><p><br></p><p>Vous ne recevrez jamais une question comme « Je veux savoir ce qui a été fait dans le dossier X dans GCpédia ». Plutôt, une demande d’accès à l’information sera probablement formulée comme ceci : « Je veux savoir ce qui a été fait dans le dossier X ». Alors, vous auriez à fouiller dans vos courriels, vos documents papier (même vos notes manuscrites personnelles), votre classeur, votre système de classement des documents électroniques, ET les OutilsGC. Les OutilsGC sont un autre endroit à vérifier sur la liste de contrôle.</p><p><br></p><p>N’oubliez pas, si un contenu quelconque de GCpédia, de GCconnex ou de GCcollab a une valeur commerciale ou est à l’origine d’une valeur ou de décisions commerciales, il aurait dû être sauvegardé dans votre dépôt officiel, comme l’exigent nos lignes directrices et politiques en matière de gestion de l’information. Par conséquent, ce contenu serait déjà dans un outil assujetti à l’AIPRP.</p><p><br></p><p>GCpédia, GCconnex et GCcollab servent à l’information transitoire, à la génération d’idées, et au partage d’information. Ils ne sont pas des dépôts officiels.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027357-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027357-fr\"><div class=\"panel-heading\"> <h5>À qui appartient le contenu?</h5></div></a><div id=\"2100027357-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><p>Chaque employé est responsable de son contenu. Si le contenu devait se révéler inapproprié ou s’il violait les conditions d’utilisation des OutilsGC, l’administrateur du groupe ne serait pas tenu responsable.</p><p><br></p><p>Par contre, une bonne pratique pour les administrateurs de groupe est de contrôler et de suivre activement les commentaires et les activités au sein de leur groupe. Vous pouvez aussi fixer vos propres règles de participation pour un groupe que vous administrez.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027358-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027358-fr\"><div class=\"panel-heading\"> <h5>Qui assure l’exactitude du contenu?</h5></div></a><div id=\"2100027358-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><p>Le partage de renseignements erronés ou périmés est toujours une possibilité, et pas seulement dans les OutilsGC.</p><p><br></p><p>Dans leurs communications et leur collaboration, les employés ont beaucoup plus de facilité à relever les erreurs, les renseignements erronés ou d’autres inexactitudes. En théorie, plus nous utilisons GCpédia, GCconnex et GCcollab, plus il y a de chances que l’information soit plus à jour et plus pertinente que celle que nous trouvons dans les sources traditionnelles (comme Wikipedia nous l’a prouvé dans le monde des encyclopédies!).</p><p><br></p><p>Si vous avez des doutes sur l’exactitude, nous vous encourageons à réviser la page ou à lancer une conversation à son sujet. Fiez-vous à votre instinct, et cherchez confirmation auprès d’une source fiable. Puis, révisez la page pour le bénéfice des autres utilisateurs. En cas de désaccord avec l’auteur d’origine, ne partez pas en guerre. Faites comme vous le feriez au cours d’une réunion ou d’une conversation de cuisine à bâtons rompus : constatez votre désaccord, sans plus.</p><p><br></p><p>Les lecteurs comprendront que le contenu de l’outil ne provient pas d’une source faisant autorité et qu’il doit être pris pour ce qu’il est : un travail en cours.</p><p>L’équipe des OutilsGC ne contrôle pas de façon centrale le contenu versé dans GCpédia, GCconnex et GCcollab. Toutes les équipes ou tous les comités ont fixé leurs règles de participation pour répartir la responsabilité de surveiller le contenu dans leurs groupes ou pages.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027362-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027362-fr\"><div class=\"panel-heading\"> <h5>Comment puis je me renseigner sur l’histoire des OutilsGC?</h5></div></a><div id=\"2100027362-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><p>Vous trouverez de l’information sur les <a href=\"http://www.gcpedia.gc.ca/wiki/GCTools/What_are_the_GCTools\">OutilsGC</a> dans GCpédia, avec les <a href=\"http://www.gcpedia.gc.ca/wiki/GCTools/Resources/Communication_Products\">ressources et produits de communication</a> qui donnent de l’information sur l’historique des OutilsGC.</p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027369-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027369-fr\"><div class=\"panel-heading\"> <h5>L’accès aux OutilsGC à partir de dispositifs personnels sera-t-il possible plus tard?</h5></div></a><div id=\"2100027369-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><div rel=\"clipboard_data\"><p>L’équipe des OutilsGC travaille à permettre un accès protégé à partir de dispositifs personnels. C’est une demande fréquente des utilisateurs.</p></div><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027370-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027370-fr\"><div class=\"panel-heading\"> <h5>Pourquoi un logiciel libre?</h5></div></a><div id=\"2100027370-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><div rel=\"clipboard_data\"><ul>\n<li><p>L’accès au code et aux applications est facile (pas de processus d’acquisition, pas de droits de licence à payer).</p></li>\n<li><p>Ils sont faciles à utiliser.</p></li>\n<li><p>Ils nécessitent très peu d’investissement. L’installation des nouveaux modules est facile et souple.</p></li>\n</ul></div><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027382-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027382-fr\"><div class=\"panel-heading\"> <h5>Qu’est-ce qu’un ambassadeur OutilsGC?</h5></div></a><div id=\"2100027382-fr\" class=\"collapse panel-body\"><span>GCConnex &gt; About the GCTools</span><p>Un ambassadeur OutilsGC est un bénévole d’un ministère ou d’une région qui fait la promotion de GCconnex, GCpédia et GCcollab en offrant du soutien aux équipes ministérielles ou régionales pour leur faire comprendre comment les OutilsGC peuvent améliorer leur travail.</p><p><br></p><p>En 2016-2017, le réseau comptait 240 ambassadeurs provenant de 50 ministères ou régions.</p><p><br></p><p><strong>Le rôle d’un ambassadeur OutilsGC est :</strong></p><ul type=\"disc\">\n<li>de faire la promotion des OutilsGC au sein de son organisme, sa collectivité et à l’échelle de la fonction publique;</li>\n<li>d’être en mesure de rechercher de manière proactive les occasions de promouvoir les OutilsGC;</li>\n<li>de nous faire parvenir les commentaires obtenus durant les présentations;</li>\n<li>de bâtir un réseau d’ambassadeurs au sein de son organisme (c’est plus amusant si on n’est plus tout seul!).</li>\n</ul><p><strong>Comment vous impliquer :</strong></p><ul type=\"disc\">\n<li>vous devez tout d’abord obtenir l’approbation de votre supérieur puisque pour faire partie du réseau des ambassadeurs OutilsGC vous aurez besoin de temps pendant vos heures de travail;</li>\n<li>demandez à vous joindre au <a href=\"http://gcconnex.gc.ca/groups/profile/662668/ambassadors-network-for-the-gc20-tools-reseau-des-ambassadeurs-des-outils-gc20\">groupe fermé GCconnex</a>;</li>\n<li>ajoutez votre nom à la <a title=\"GCTools Ambassadors/Find Ambassador\" href=\"http://www.gcpedia.gc.ca/wiki/GCTools_Ambassadors/Find_Ambassador\">liste des ambassadeurs</a>;</li>\n<li>inscrivez-vous à une des séances d’orientations prévues (voir le calendrier pour les dates et les modalités d’inscription);</li>\n<li>ajoutez un écusson d’ambassadeur à votre avatar GCconnex;</li>\n<li>ajoutez la boîte d’utilisateur Ambassadeur OutilsGC à votre profil GCpédia.</li>\n</ul><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div></div> </div></div> </div><div class=\"article-cat\"><a href=\"#2100018917-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018917-fr\"><div class=\"\"> <h3>FAQs</h3></div></a><div id=\"2100018917-fr\" class=\"collapse\"><div class=\"folder\"><a href=\"#2100029398-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029398-fr\"><div class=\"\"> <h4>Overview</h4></div></a><div id=\"2100029398-fr\" class=\"collapse\"><div class=\"panel help-article\"><a href=\"#2100027350-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027350-fr\"><div class=\"panel-heading\"> <h5>Quel type de documents/d’information pouvons-nous afficher/verser dans les OutilsGC?</h5></div></a><div id=\"2100027350-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Puisque les OutilsGC sont un réseau <strong>interne</strong> du gouvernement du Canada, les employés doivent suivre les mêmes règles que s’ils envoyaient un document par courriel.</p><p><br></p><p>Comme les OutilsGC ne sont pas sur un réseau protégé, vous ne devriez rien afficher ni verser qui est classé plus haut que protégé A. Il ne suffit pas qu’un document soit marqué « privé » ou « réservé aux membres du groupe » dans GCconnex ou dans GCollab pour échapper à cette exigence.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027351-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027351-fr\"><div class=\"panel-heading\"> <h5>Les OutilsGC sont-ils accessibles aux employés handicapés?</h5></div></a><div id=\"2100027351-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Les fonctionnaires qui utilisent des lecteurs d’écran et d’autres appareils et accessoires fonctionnels peuvent utiliser avec succès GCpédia, GCconnex et GCcollab.</p><p><br></p><p>En tant qu’administrateurs, les membres de l’équipe des OutilsGC mettent tout en œuvre pour permettre à tous les utilisateurs d’avoir accès aux outils et de les utiliser.</p><p><br></p><p>L’équipe des OutilsGC s’est faite partenaire de Statistique Canada pour des tests d’accessibilité dans GCconnex. GCconnex a reçu une note de conformité relativement élevée, mais Statistique Canada a relevé plusieurs points que nous pouvons corriger pour améliorer l’accessibilité du site. Avec l’aide de StatCan, notre équipe technique a mis en œuvre plusieurs améliorations clés d’accessibilité au printemps de 2015.</p><p><br></p><p>En tant que <em>contributeur</em>, vous devez veiller à ce que le contenu que vous versez dans les OutilsGC soit le plus accessible possible pour tous les utilisateurs. Soyez conscient du fait qu’un certain formatage spécialisé ou certains types de support peuvent augmenter sensiblement le risque de problèmes d’accessibilité.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027354-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027354-fr\"><div class=\"panel-heading\"> <h5>N’y a t il pas double emploi avec GCDocs?</h5></div></a><div id=\"2100027354-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Non. GCDocs est un dépôt officiel d’information de valeur commerciale. GCpédia, GCconnex et GCcollab sont tous des dépôts d’information temporaires.</p><p><br></p><p>Si un contenu versé dans GCpédia pour être partagé avec les fonctionnaires d’autres ministères a une valeur commerciale, il aurait aussi dû être versé d’abord dans le dépôt de documents de votre ministère.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027356-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027356-fr\"><div class=\"panel-heading\"> <h5>Pourquoi ne puis je pas utiliser de pseudonyme dans les OutilsGC?</h5></div></a><div id=\"2100027356-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Les OutilsGC sont des plateformes de maillage et de collaboration professionnels. La collaboration repose sur la confiance et nous devrions tous être facilement identifiables. N’oubliez pas que votre profil d’utilisateur est relié à votre adresse de courriel et que votre nom d’utilisateur complet (habituellement PrénomRéel.NomdeFamilleRéel) apparaît de toute façon dans la barre d’adresse. Par conséquent, il ne sert à rien de chercher à se cacher derrière un nom d’écran.</p><p><br></p><p>En vous inscrivant, vous devez accepter les conditions. L’utilisation de votre nom réel fait partie des conditions que vous acceptez au moment de vous inscrire.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027359-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027359-fr\"><div class=\"panel-heading\"> <h5>Qu’arrive-t-il si des employés affichent des commentaires inappropriés ou grossiers?</h5></div></a><div id=\"2100027359-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Il est très rare qu’un contenu inapproprié se retrouve dans les OutilsGC, en partie parce que nous ne permettons pas l’affichage anonyme.</p><p><br></p><p>Rappelez-vous que ce n’est pas parce que vous n’êtes pas d’accord sur un commentaire que vous pouvez dire qu’il est inapproprié. Cependant, si vous tombez sur un contenu qui viole nos conditions d’utilisation des OutilsGC, prière d’en informer <a href=\"mailto:admin.GCPEDIA@tbs-sct.gc.ca?subject=flag%20of%20inappropriate%20content%20or%20behaviour&amp;body=If%20you%20believe%20that%20content%20or%20behaviour%20violates%20the%20terms%20of%20use,%20please%20provide%20a%20description%20of%20the%20inappropriate%20behaviour%20or%20content,%20the%20name%20of%20the%20person%20implicated,%20and%20the%20hyperlinks%20if%20possible.%20The%20content%20or%20behaviour%20will%20be%20reviewed.\"><u>l’équipe des OutilsGC</u></a>, qui fera le nécessaire pour communiquer avec l’auteur du contenu et/ou pour supprimer le contenu.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027360-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027360-fr\"><div class=\"panel-heading\"> <h5>Entreposage ou distribution des documents : dois-je utiliser GCconnex ou GCpédia?</h5></div></a><div id=\"2100027360-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Si vous voulez partager des documents ouvertement avec <strong>tous les fonctionnaires de façon visuellement structurée</strong>, GCpédia est probablement préférable si vous êtes à l’aise avec la création de pages dans MediaWiki (vous pouvez aussi réutiliser le code des pages que vous aimez pour vous faciliter la tâche!).</p><p><br></p><p>Si la documentation est partagée par un <strong>groupe/comité de travail</strong>, alors GCconnex est probablement préférable. Les membres chercheront des fichiers dans des dossiers de la même façon que dans un système ordinaire de lecteur sur ordinateur.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027361-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027361-fr\"><div class=\"panel-heading\"> <h5>Notre ministère a déjà SharePoint (ou un autre outil de collaboration). Devrions-nous quand même utiliser les OutilsGC?</h5></div></a><div id=\"2100027361-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>Oui! Parfois les outils ministériels seront les bons outils, et parfois les OutilsGC seront les outils appropriés. Tout dépend de ce que vous faites et de votre groupe cible.</p><p><br></p><p>Les outils de collaboration des ministères ne se prêtent<strong>&nbsp;pas</strong> à la collaboration interministérielle. Les ministères peuvent utiliser gratuitement les OutilsGC, qui sont les seuls disponibles pour le partage d’information et la collaboration avec les fonctionnaires fédéraux à l’échelle de la fonction publique dans toutes les regions.</p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027368-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027368-fr\"><div class=\"panel-heading\"> <h5>Puis-je accéder aux OutilsGC à partir de chez moi?</h5></div></a><div id=\"2100027368-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><div rel=\"clipboard_data\"><p>GCpédia et GCconnex sont accessibles sur le réseau du gouvernement du Canada seulement. Par conséquent, si vous avez accès à ce réseau à partir de chez vous, via un RPV à votre réseau ministériel ou par un Blackberry du gouvernement, vous pouvez y accéder. Vous pouvez accéder à GCcollab à la maison puisqu’il est disponible en dehors du réseau du gouvernement du Canada.</p></div><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div><div class=\"panel help-article\"><a href=\"#2100027371-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027371-fr\"><div class=\"panel-heading\"> <h5>Qu’est-ce que l’accès simplifié?</h5></div></a><div id=\"2100027371-fr\" class=\"collapse panel-body\"><span>FAQs &gt; Overview</span><p>L’accès simplifié permet aux utilisateurs de se raccorder à GCpédia et à GCconnex simultanément.</p><p><br></p><p>En premier lieu, vous devez relier vos comptes GCpédia et GCconnex (à faire une seule fois). Une fois vos comptes reliés, lorsque vous entrerez dans GCconnex, vous serez automatiquement aussi dans GCpédia, et vice versa. Lorsque vous vous inscrivez par GCpédia, utilisez le bouton « Accès simplifié » pour tirer parti de la fonction d’accès simplifié.</p><p><br></p><p>Pour plus d’information, voir le <a href=\"http://www.gcpedia.gc.ca/wiki/GCconnex_User_Help/Get_Started/How_do_I_Use_the_Simplified_Sign_On_to_Simultaneously_Connect_to_GCconnex_and_GCpedia%3F\"><u>tutoriel sur l’accès simplifié</u>.</a></p><p><br></p><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div></div> </div></div> </div><div class=\"article-cat\"><a href=\"#2100018918-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018918-fr\"><div class=\"\"> <h3>Documentation d'aide</h3></div></a><div id=\"2100018918-fr\" class=\"collapse\"><div class=\"folder\"><a href=\"#2100029477-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029477-fr\"><div class=\"\"> <h4>Pour commencer</h4></div></a><div id=\"2100029477-fr\" class=\"collapse\"><div class=\"panel help-article\"><a href=\"#2100027173-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100027173-fr\"><div class=\"panel-heading\"> <h5>Comment ajouter un écusson à mon avatar</h5></div></a><div id=\"2100027173-fr\" class=\"collapse panel-body\"><span>Documentation d'aide &gt; Pour commencer</span><p>Vous pouvez ajouter un écusson à votre avatar pour démontrer votre implication ou soutient pour un group ou initiative interministérielle. Afin d’ajouter un écusson à votre avatar de GCconnex, vous devez :</p><ul>\n<li>Être connecté dans GCconnex ; et</li>\n<li>Être membre du groupe spécifique lié à l’initiative.</li>\n</ul><p><br></p><h3><strong>Option 1 : Ajouter un écusson à partir de la page du groupe</strong></h3><ol>\n<li>&nbsp;Allez au groupe GCconnex lié à l’initiative.&nbsp;</li>\n<li>&nbsp;À partir de la page du groupe, vous pouvez ajouter l’écusson en sélectionnant le bouton &nbsp;« &nbsp;Ajouter à mon avatar » du widget (boite) de l’initiative qui apparait dans le coin supérieur droit de la page du groupe. Vous recevrez un message indiquant que l’écusson a été ajouté à votre avatar, et votre avatar sera automatiquement mis à jour.<a href=\"http://www.gcpedia.gc.ca/wiki/File:%C3%89cusson_SM.JPG\"><u><img class=\"fr-draggable fr-dib\" style=\"width: 350px; height: 200px;\" alt=\"Écusson SM.JPG\" src=\"http://www.gcpedia.gc.ca/gcwiki/images/thumb/b/ba/%C3%89cusson_SM.JPG/350px-%C3%89cusson_SM.JPG\"></u></a><br>\n</li>\n<li>&nbsp;Une fois que l’écusson a été ajouté, le widget disparaîtra du groupe.</li>\n</ol><p><br></p><h3><strong>Option 2 : À partir de votre profil d’utilisateur</strong></h3><ol>\n<li>&nbsp;Allez à votre page de profil d’utilisateur.&nbsp;</li>\n<li>&nbsp;Sélectionnez &nbsp;sur le bouton « Modifier » dans le coin supérieur droit de votre carte de renseignement. Une fenêtre s’ouvrira pour modifier vos renseignements personnels.&nbsp;<p><img class=\"fr-draggable fr-dib\" style=\"width: 550px; height: 205px;\" alt=\"Carte erin.JPG\" src=\"http://www.gcpedia.gc.ca/gcwiki/images/thumb/9/91/Carte_erin.JPG/550px-Carte_erin.JPG\"><br></p>\n</li>\n<li>&nbsp;Sélectionnez &nbsp;« Modifier mon avatar » dans le coin supérieur gauche de la fenêtre.&nbsp;<p><img class=\"fr-draggable fr-dib\" style=\"width: 550px; height: 330px;\" alt=\"Modifier votre profil.JPG\" src=\"http://www.gcpedia.gc.ca/gcwiki/images/thumb/a/ac/Modifier_votre_profil.JPG/550px-Modifier_votre_profil.JPG\"><br></p>\n</li>\n<li>&nbsp;Déroulez au bas de la page, sous le menu déroulant « Ajouter insigne de groupe », sélectionnez l’écusson que vous désirez ajouter à votre avatar. &nbsp;&nbsp;<p><img class=\"fr-draggable fr-dib\" style=\"width: 550px; height: 422px;\" alt=\"Avatar-GCconnex.JPG\" src=\"http://www.gcpedia.gc.ca/gcwiki/images/thumb/5/56/Avatar-GCconnex.JPG/550px-Avatar-GCconnex.JPG\"><br></p>\n<p><br></p>\n</li>\n<li>&nbsp;Sélectionnez &nbsp;le bouton « Créez votre avatar » pour mettre à jour votre avatar avec le nouvel écusson. &nbsp;</li>\n</ol><p><br></p><p>Vous pouvez supprimer un écusson de votre avatar à tout moment. Veuillez suivre les étapes suivantes :&nbsp;</p><ol>\n<li>&nbsp;Connectez-vous à GCconnex.</li>\n<li>&nbsp;Allez à votre page de profil d’utilisateur.</li>\n<li>&nbsp;Sélectionnez &nbsp;sur le bouton « Modifier » dans le coin supérieur droit de votre carte de renseignement. Une fenêtre s’ouvrira pour modifier vos renseignements personnels.</li>\n<li>&nbsp;Sélectionnez &nbsp;« Modifier mon avatar » dans le coin supérieur gauche de la fenêtre.</li>\n<li>&nbsp;Déroulez au bas de la page, sous le menu déroulant « Ajouter insigne de groupe », sélectionnez le champ vide (ligne pointillé) pour supprimer l’écusson de votre avatar.</li>\n<li>&nbsp;Sélectionnez &nbsp;le bouton « Créez votre avatar » pour mettre à jour votre avatar et supprimer l’écusson.</li>\n</ol><p><br></p><hr><h2>Articles liées</h2><ul>\n<li>\n<a href=\"https://gcconnex.gctools-outilsgc.ca/solution/articles/2100027337/fr\">Comment puis-je modifier mon avatar?</a><a href=\"https://gcconnex.gctools-outilsgc.ca/solution/articles/2100027336/fr\"></a>\n</li>\n<li>\n<a href=\"https://gcconnex.gctools-outilsgc.ca/solution/articles/2100027336/fr\">Comment réviser votre profil</a><a href=\"https://gcconnex.gctools-outilsgc.ca/solution/articles/2100027146/fr\"></a><a href=\"https://gcconnex.gctools-outilsgc.ca/solution/articles/2100027146/fr\"></a>\n</li>\n<li><a href=\"https://gcconnex.gctools-outilsgc.ca/solution/articles/2100027146/fr\">Comment puis-je accéder à un groupe et m’y joindre?</a></li>\n</ul><div class=\"article-feedback\">Did you find this helpful? <a class=\"mrgn-lft-sm\" href=\"#\">Yes 0</a> <a class=\"mrgn-lft-sm\" href=\"#\">No 0</a> </div> </div> </div></div> </div><div class=\"folder\"><a href=\"#2100029483-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029483-fr\"><div class=\"\"> <h4>La gestion du contenu et la collaboration</h4></div></a><div id=\"2100029483-fr\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029501-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029501-fr\"><div class=\"\"> <h4>Réseauter avec des collègues</h4></div></a><div id=\"2100029501-fr\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029502-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029502-fr\"><div class=\"\"> <h4>Modifier mes paramètres de compte</h4></div></a><div id=\"2100029502-fr\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029559-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029559-fr\"><div class=\"\"> <h4>La propriété et la gestion des groupes</h4></div></a><div id=\"2100029559-fr\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029571-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029571-fr\"><div class=\"\"> <h4>Widgets</h4></div></a><div id=\"2100029571-fr\" class=\"collapse\"></div> </div><div class=\"folder\"><a href=\"#2100029506-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100029506-fr\"><div class=\"\"> <h4>Carrefour d'emploi</h4></div></a><div id=\"2100029506-fr\" class=\"collapse\"></div> </div></div> </div><div class=\"article-cat\"><a href=\"#2100018919-fr\" data-toggle=\"collapse\" aria-expanded=\"false\" aria-controls=\"2100018919-fr\"><div class=\"\"> <h3>Mobilisation des utilisateurs</h3></div></a><div id=\"2100018919-fr\" class=\"collapse\"></div> </div>"}