Repository: gctools-outilsgc/gcconnex
Catalog: docs/locale/*/LC_MESSAGES/tutorials.po
Languages: fr

source: Elgg automatically scans particular directories under plugins looking for particular files. :doc:`/guides/views` make it easy to add your display code or do other things like override default Elgg behavior. For now, we will just be adding the view code for your widget. Create a file at ``/mod/hello/views/default/widgets/helloworld/content.php``. “helloworld” will be the name of your widget within the hello plugin. In this file add the code:
fr: Elgg scanne automatiquement certains répertoires des plugins pour trouver certains fichiers spécifiques. Les vues :doc:`/guides/views` rendent aisé d'ajouter votre code d'affichage ou de faire d'autres choses telles que surcharger le comportement par défaut d'Elgg. Pour le moment, nous allons simplement ajouter le code d'affichage pour votre widget. Créez un fichier ``/mod/hello/views/default/widgets/helloworld/content.php``. “helloworld” sera le nom de votre widget à l'intérieur du plugin hello. Dans ce fichier ajoutez le code :

source: This will add these words to the widget canvas when it is drawn. Elgg takes care of loading the widget.
fr: Ceci va ajouter ces mots au canevas du widget lorsqu'il sera rendu. Elgg se charge de charger le widget.

source: Registering your widget
fr: Enregistrer votre widget

source: Elgg needs to be told explicitly that the plugin contains a widget so that it will scan the widget views directory. This is done by calling the elgg\_register\_widget\_type() function. Edit ``/mod/hello/start.php``. In it add these lines:
fr: Elgg a besoin qu'on lui indique explicitement que le plugin contient un widget pour qu'il vérifie le répertoires des vues du widget. Ceci est fait en appelant la fonction elgg\_register\_widget\_type(). Modifiez `/mod/hello/start.php``. Ajoutez dedans ces lignes :

source: Now go to your profile page using a web browser and add the “hello, world” widget. It should display “Hello, world!”.
fr: Rendez-vous maintenant sur votre page de profil avec un navigateur web et ajoutez le widget “hello, world”. Il devrait afficher “Hello, world!”.

source: For real widgets, it is always a good idea to support :doc:`/guides/i18n`.
fr: Pour de vrais widgets, c'est toujours une bonne idée de respecter :doc:`/guides/i18n`.

source: Allow user customization
fr: Permettre les personnalisation par l'utilisateur

source: Click on the edit link on the toolbar of the widget that you've created. You will notice that the only control it gives you by default is over access (over who can see the widget).
fr: Cliquez sur le lien d'adition dans la barre d'outils du widget que vous avez créé. Vous allez noter que le seul contrôle qu'il vous offre par défaut est sur le niveau d'accès (sur qui peut voir le widget).

source: Suppose you want to allow the user to control what greeting is displayed in the widget. Just as Elgg automatically loads ``content.php`` when viewing a widget, it loads ``edit.php`` when a user attempts to edit a widget. In ``/mod/hello/views/default/widgets/helloworld/``, create a file named ``edit.php``. In this file, add the following code:
fr: Supposez que vous voulez permettre à l'utilisateur de contrôler quel message d'accueil est affiché dans le widget. De la même manière qu'Elgg charge automatiquement ``content.php`` pour afficher un widget, il charge ``edit.php`` quand un utilisateur tente de modifier un widget. Dans ``/mod/hello/views/default/widgets/helloworld/``, créez un fichier nommé ``edit.php``. Dans ce fichier, ajoutez le code suivant :

source: Notice the relationship between the values passed to the 'name' and the 'value' fields of input/text. The name of the input text box is ``params[message]`` because Elgg will automatically handle widget variables put in the array ``params``. The actual php variable name will be ``message``. If we wanted to use the field ``greeting`` instead of ``message`` we would pass the values ``params[greeting]`` and ``$widget->greeting`` respectively.
fr: Notez la relation entre les valeurs passées aux champs 'name' (nom) et 'value' (valeur) d'input/text. Le nom du champ de la boîte de saisie de texte est ``params[message]`` parce qu'Elgg va automatiquement gérer les variables des widgets placées dans le tableau ``params``. Le nom de la variable PHP correspondante sera ``message``. Si nous voulions utiliser le champ ``greeting`` au lieu de ``message`` nous passerions respectivement les valeurs ``params[greeting]`` et ``$widget->greeting``.

source: The reason we set the 'value' option of the array is so that the edit view remembers what the user typed in the previous time he changed the value of his message text.
fr: La raison pour laquelle nous définissons l'option 'value' du tableau est que ceci indique à la vue d'édition de se souvenir de ce que l'utilisateur a saisi la dernière fois qu'il a modifié la valeur du texte du message.

source: Now to display the user's message we need to modify content.php to use this *message* variable. Edit content.php and change it to:
fr: Maintenant pour afficher le message de l'utilisateur nous devons modifier content.php pour qu'il utilise cette variable *message*. Modifiez content.php et modifiez-le pour :

source: You should now be able to enter a message in the text box and see it appear in the widget.
fr: Vous devriez maintenant pouvoir saisir un message dans la boîte de texte et le voir apparaître dans le widget.

source: Integrating a Rich Text Editor
fr: Intégrer un éditeur de texte visuel (Rich Text Editor)

source: Build your own wysiwyg plugin.
fr: Construisez votre propre plugin wysiwyg.

source: Elgg is bundled with a plugin for CKEditor_, and previously shipped with TinyMCE_ support. However, if you have a wysiwyg that you prefer, you could use this tutorial to help you build your own.
fr: Elgg est distribué avec un plugin pour CKEditor_, et précédemment distribué avec le support de TinyMCE. Cependant, s'il y a un éditeur wysiwyg que vous préférez, vous pourriez utiliser ce tutoriel pour construire le vôtre.

source: All forms in Elgg should try to use the provided input views located in ``views/default/input``. If these views are used, then it is simple for plugin authors to replace a view, in this case longtext.php, with their wysiwyg.
fr: Tous les formulaires dans Elgg devraient essayer d'utiliser les vues de saisies situées dans ``views/default/input``. Si ces vues sont utilisées, il est plus aisé pour les auteurs de plugins de remplacer une vue, ici longtext.php, par leur propre vue avec wysiwyg.

source: Create your plugin skeleton
fr: Créez le squelette de votre plugin

source: You will need to create your plugin and give it a start.php file where the plugin gets initialized, as well as a manifest.xml file to tell the Elgg engine about your plugin.
fr: Vous devrez créer votre plugin et lui donner un fichier start.php dans lequel le plugin sera initialisé, ainsi qu'un fichier manifest.xml pour donner au moteur d'Elgg des informations à propos de votre plugin.

source: Read more in the guide about :doc:`/guides/plugins`.
fr: Lisez-en plus dans le guide à propos de :doc:`/guides/plugins`.

source: Add the WYSIWYG library code
fr: Ajoutez la bibliothèque de code WYSIWYG

source: Now you need to upload TinyMCE into a directory in your plugin. We strongly encourage you to put third party libraries in a “vendors” directory, as that is standard practice in Elgg plugins and will make your plugin much more approachable by other developers::
fr: Maintenant vous avez besoin de charger TinyMCE dans un répertoire de votre plugin. Nous recommandons vivement que vous mettiez les bibliohtèques tierces dans un répertoire “vendors”, car il s'agit de la manière de faire standard dans les plugins Elgg et cela rendra votre plugin plus facile à appréhender par d'autres développeurs ::

source: Tell Elgg when and how to load TinyMCE
fr: Dites à Elgg quand et comment charger TinyMCE

source: Now that you have:
fr: Maintenant que vous avez :

source: created your start file
fr: créé le fichier de démarrage

source: intialized the plugin
fr: initialisé le plugin

source: uploaded the wysiwyg code
fr: chargé le code wysiwyg

source: It is time to tell Elgg how to apply TinyMCE to longtext fields.
fr: Il est temps de dire à Elgg comment appliquer TinyMCE aux champs de saisie de texte.

source: We're going to do that by extending the input/longtext view and including some javascript. Create a view tinymce/longtext and add the following code:
fr: Nous allons faire ceci en étendant la vue input/longtext et en incluant un peu de JavaScript. Créez une vue tinymce/longtext et ajoutez le code suivant :

source: Then, in your plugin's init function, extend the input/longtext view
fr: Puis, dans la fonction init de votre plugin, étendez la vue input/longtext

source: That's it! Now every time someone uses input/longtext, TinyMCE will be loaded and applied to that textarea.
fr: Et voilà ! Désormais chaque fois que quelqu'un utilise input/longtext, TinyMCE sera chargé et appliqué à cette zone de texte.
