Repository: gctools-outilsgc/gcconnex
Catalog: docs/locale/*/LC_MESSAGES/tutorials.po
Languages: fr

source: Building a Blog Plugin
fr: Développer un plugin de Blog

source: Build a simple blogging plugin using Elgg.
fr: Créer un plugin de blog simple avec Elgg/

source: This duplicates features in the bundled blog plugin, so be sure to disable that while working on your own version.
fr: Ceci duplique des fonctionnalités du plugin blog de la distribution, aussi vérifiez qu'il est bien désactivé pendant que vous travaillez sur votre propre version.

source: Contents
fr: Contenus

source: Create the plugin skeleton
fr: Créer le squelette du plugin

source: The name of the directory under "mod" becomes the id of your plugin::
fr: Le nom du dossier dans "mod" devient l'id de votre plugin :

source: You'll need to add a manifest file in ``/mod/my_blog/manifest.xml``. This file stores basic information about the plugin. See :doc:`/guides/plugins` for the template. You can also just copy the manifest file from another plugin and then change the values to fit your new plugin. Be sure to change the author and website, and remove the “bundled” category!
fr: Vous devez ajouter un fichier manifest.xml dans ``/mod/my_blog/manifest.xml``. Ce fichier stocke des informations basiques à propos du plugin. Voyez :doc:`/guides/plugins` pour un modèle. Vous pouvez également seulement copier le manifest d'un autre plugin et modifier les valeurs pour celles de votre nouveau plugin. Faites attention à modifier l'auteur et le site du plugin, ainsi qu'à supprimé la catégorie “bundled” !

source: Create a page for composing the blogs
fr: Créer une page pour composer les articles de blog

source: Create the file ``add.php`` in ``/mod/my_blog/pages/my_blog/``.
fr: Créez le fichier ``add.php`` dans ``/mod/my_blog/pages/my_blog/``.

source: Create the form for creating a new my\_blog post
fr: Créer le formulaire pour créer une nouvelle publication my_blog

source: Create a file at ``/mod/my_blog/views/default/forms/my_blog/save.php`` that contains the form body. This corresponds to view that is called above: ``elgg_view_form("my_blog/save")``.
fr: Créez un fichier ``/mod/my_blog/views/default/forms/my_blog/save.php`` qui contient le corps du formulaire. Cela correspond à la vue appelée de la manière suivante : ``elgg_view_form("my_blog/save")``.

source: The form should have input fields for the title, body and tags. Because you used ``elgg_view_form()``, you do not need to include form tag markup. The view will be automatically wrapped with:
fr: Le formulaire devrait avoir des champs de saisie pour le titre, le corps de texte et les tags. Dans la mesure où vous utilisez ``elgg_view_form()``, vous n'avez pas besoin d'inclure les balises du formulaire. La vue sera automatiquement enveloppée avec :

source: a ``<form>`` tag and the necessary attributes
fr: une balise ``<form>`` et les attributs nécessaires

source: anti-csrf tokens
fr: tokens anti-csrf

source: The form's action will be ``"<?php echo elgg_get_site_url() ?>action/my_blog/save"``, which we will create in a moment. Here is the content of ``/mod/my_blog/views/default/forms/my_blog/save.php``:
fr: L'action du formulaire sera ``"<?php echo elgg_get_site_url() ?>action/my_blog/save"``, qui nous allons créer dans un instant. Voici le contenu de ``/mod/my_blog/views/default/forms/my_blog/save.php``:

source: Notice how the form is calling input views like ``input/longtext``. These are built into Elgg and make it easy to add form components. You can see a complete list of input views in the ``/views/default/input/`` directory.
fr: Notez comment le formulaire fait appel à des vues de saisie telles que ``input/longtext``. Celles-ci sont incluses dans Elgg et facilitent l'ajout d'éléments de formulaire. Vous pouvez voir une liste complète des vues de saisie dans le répertoire ``/views/default/input/``.

source: The above code is not accessibility-friendly.
fr: Le code ci-dessus ne respecte pas les règles d'accessibilité.

source: The action file
fr: Le fichier d'action

source: Create the file ``/mod/my_blog/actions/my_blog/save.php``. This will save the blog post to the database.
fr: Créez le fichier ``/mod/my_blog/actions/my_blog/save.php``. Ceci va enregistrer l'article de blog dans la base de données.

source: A few fields are built into Elgg objects. Title and description are two of these. It makes sense to use description to contain the my\_blog text. Every entity can have a subtype and in this we are using ``"my_blog"``. The tags are stored as metadata.
fr: Un certain nombre de champs sont intégrés dans les objets Elgg. Le titre et la description sont deux de ces champs. Il est logique d'utiliser la description pour contenir le texte de my\_blog. Chaque entité peut avoir un sous-type (subtype) et dans ce cas nous utilisons ``"my_blog"``. Les tags sont stockés sous forme de métadonnées.

source: Every object in Elgg has a built-in URL automatically, although you can override this if you wish. The ``getURL()`` method is called to get that unique URL.
fr: Chaque objet dans Elgg dispose automatiquement d'une URL, mais vous pouvez la surcharger si vous le souhaitez. La méthode ``getURL()`` est appelée pour récupérer cette URL unique.

source: The object view
fr: La vue de l'objet

source: Elgg will automatically call the ``object/my_blog`` view to view the my\_blog post so we need to create the object view.
fr: Elgg va automatiquement appeler la vue ``object/my_blog`` pour afficher l'article my\_blog aussi nous devons créer la vue de cet objet.

source: Objects in Elgg are a subclass of something called an “entity”. Users, sites, and groups are also subclasses of entity. All entities can (and should) have a subtype, which allows granular control for listing and displaying. Here, we have used the subtype "``my_blog``\ " to identify a my\_blog post, but any alphanumeric string can be a valid subtype. When picking subtypes, be sure to pick ones that make sense for your plugin.
fr: Les objets dans Elgg sont un sous-classe de quelque chose appelé une "entité" (entity). Les utilisateurs, les sites et les groupes sont également des sous-classes d'une entité. Toutes les entitiés peuvent (et devraient) avoir un sous-type, ce qui permet un contrôle plus fin sur les listings et l'affichage. Ici, nous avons utilisé le sous-type (subtype) "``my_blog``\ " pour identifier un article de my\_blog, mais n'importe quelle chaîne de caractères alphanumérique peut être un sous-type valide. Lorsque vous choisissez un sous-type, assurez-vous d'en choisir un qui ait du sens pour votre plugin.

source: In ``/mod/my_blog/views/default/``, create a folder ``/object/`` and then create a file ``my_blog.php`` in it.
fr: Dans ``/mod/my_blog/views/default/``, créez un répertoire ``/object/`` et créez dedans un fichier ``my_blog.php``.

source: Each my\_blog post will be passed to this PHP file as ``$vars['entity']``. (``$vars`` is an array used in the views system to pass variables to a view.) The content of ``object/my_blog.php`` can just be something like:
fr: Chaque article my\_blog sera passé à ce fichier PHP sous la forme ``$vars['entity']``. (``$vars`` est un tableau utilisé dans le système de vues pour passer des variables à un vue.) Le contenu de ``object/my_blog.php`` peut être simplement quelque chose comme ceci :

source: The last line takes the tags on the my\_blog post and automatically displays them as a series of clickable links. Search is handled automatically.
fr: La dernière ligne prend les tags de l'article my\_blog et les affiche automatiquement sous la forme d'une série de liens cliquables. La recherche est gérée automatiquement.

source: (If you're wondering about the '``default``\ ' in ``/views/default/``, you can create alternative views. RSS, OpenDD, FOAF, mobile and others are all valid view types.)
fr: (Si vous vous interrogez à propos de '``default``\ ' dans ``/views/default/``, vous pouvez créer des vues alternatives. RSS, OpenDD, FOAF, mobile et d'autres sont des types de vues valides.)

source: Plugin start.php
fr: start.php du plugin

source: Every plugin has a ``start.php`` that initializes it. For this example, we just need to register the action file we created earlier: Also see a related guide about :doc:`/guides/actions`.
fr: Chaque plugin a un fichier ``start.php`` qui l'initialise. Pour cet exemple, nous avons seulement besoin d'enregistrer le fichier d'action que nous avons créé précédemment. Voyez également un guide connexe à propos des :doc:`/guides/actions`.

source: The action will now be available as ``/action/my_blog/save``. By default, all actions are available only to logged in users. If you want to make an action available to only admins or open it up to unauthenticated users, you can pass 'admin' or 'public' as the third parameter of ``elgg_register_action()``, respectively.
fr: L'action sera désormais disponible sous ``/action/my_blog/save``. Par défaut, toutes les actions ne sont accessibles qu'aux utilisateurs connectés. Si vous souhaitez faire qu'une action ne soit accessible qu'aux administrateurs, ou si vous souhaitez la rendre utilisable y compris par des utilisateurs non connectés, vous pouvez passer respectivement 'admin' ou 'public' en troisième paramètre de ``elgg_register_action()``.

source: Registering a page handler
fr: Définir un gestionnaire de page

source: In order to be able to serve the page that generates the form, you'll need to register a page handler. Add the following to your start.php:
fr: Afin de pouvoir afficher la page qui génère le formulaire, vous devez enregistrer un gestionnaire de page (page handler). Ajoutez ce qui suit à votre start.php :

source: Page handling functions need to return ``true`` or ``false``. ``true`` means the page exists and has been handled by the page handler. ``false`` means that the page does not exist and the user will be forwarded to the site's 404 page (requested page does not exist or not found). In this particular example, the URL must contain ``/my_blog/add`` for the user to view a page with a form, otherwise the user will see a 404 page.
fr: Les fonctions de gestion des pages doivent retourner ``true`` ou ``false``. ``true`` signifie que la page existe et a bien été gérée par le gestionnaire de page. ``false`` signifie que la page n'existe pas et que l'utilisateur sera renvoyé vers la page 404 du site (la page demandée n'existe pas ou n'a pas été trouvée). Dans ce cas particulier, l'URL doit contenir ``/my_blog/add`` pour que l'utilisateur puisse voir une page avec un formulaire, autrement il verra une page 404.

source: Trying it out
fr: Tester le plugin

source: If you have not enabled the plugin yet, you will need to go to Administration => Configure => Plugins => Advanced. Scroll to the bottom until you see your plugin. Click the Enable button.
fr: Si vous n'avez pas encore activé le plugin, vous allez avoir besoin d'aller dans Administration => Configurer => Plugins => Avancé. Faites défiler vers le bas jusqu'à ce que vous voyiez apparaître votre plugin. Cliquez sur le bouton Activer.

source: The page to create a new my\_blog post is accessible at http://yoursite/my_blog/add. Try it out.
fr: La page pour créer une nouvelle publication my\_blog est accessible sur http://yoursite/my_blog/add. Essayez-la.

source: Displaying list of my\_blogs
fr: Afficher la liste de my_blogs

source: Let's also create a page that lists my\_blog entries that have been created.
fr: Créons également une page qui liste les entrées my_blog qui ont été créées.

source: Create ``/mod/my_blog/pages/my_blog/all.php``.
fr: Créer "/mod/my_blog/pages/my_blog/all.php".

source: To grab the latest my\_blog posts, we'll use ``elgg_list_entities``. Note that this function returns only the posts that the user can see, so access restrictions are handled transparently:
fr: Pour récupérer les dernières publications my\_blog, nous allons utiliser ``elgg_list_entities``. Notez que cette fonction ne retourne que les publications que l'utilisateur a le droit de voir, ainsi les droits d'accès sont gérés de manière transparente :

source: The function \`elgg\_list\_entities\` (and its cousins) also transparently handle pagination, and even create an RSS feeds for your my\_blogs if you have defined these views.
fr: La fonction \`elgg\_list\_entities\` (et ses cousines) gère également de manière transparente la pagination, et crée même des flux RSS pour vos my\_blogs si vous avez définies ces vues.

source: Finally, we'll draw the page:
fr: Finalement, nous allons afficher la page :

source: We will then need to modify our my\_blog page handler to grab the new page when the URL is set to ``/my_blog/all``. So, your new ``my_blog_page_handler()`` function in start.php should look like:
fr: Nous allons ensuite devoir modifier notre gestionnaire de page my\_blog pour qu'il récupère la nouvelle page quand l'URL est ``/my_blog/all``. Pur cela, votre nouvelle fonction my_blog_page_handler()`` dans start.php devrait ressembler à ceci :

source: Now, if the URL contains just ``/my_blog`` or ``/my_blog/all``, the user will see an "All Site Blogs" page.
fr: Désormais, si l'URL ne contient que ``/my_blog`` ou ``/my_blog/all``, l'utilisateur verra la page "Tous les articles du site".

source: A user's blog page
fr: La page du blog d'un utilisateur

source: If we grab the Global Unique IDentifier (GUID) of the logged in user, we can limit the my\_blog posts to those posted by specifying the owner\_guid argument in the list function above.
fr: Si nous récupérons l'identifiant global unique (GUID, pour Global Unique IDentifier) de l'utilisateur connecté, nous pouvons restreindre l'affichage des publications my\_blog à celle qu'il a publiées en spécifiant l'argument owner\_guid dans la liste de fonctions ci-dessous.

source: The end
fr: FIN

source: There's much more that could be done for this plugin, but hopefully this gives you a good idea of how to get started with your own.
fr: Il y a bien d'autres choses qui pourraient être faites avec ce plugin, mais nous espérons que cela vous donne déjà une bonne idée de comment démarrer avec votre propre plugin.

source: This tutorial shows you how to build a simple plugin that adds a new page and prints the text "Hello world" on it.
fr: Ce tutoriel vous montre comment contruire un plugin silmple qui ajoute une nouvelle page et affiche dessus le texte "Hello world".

source: In this tutorial we will use the address ``http://www.mysite.com/`` as an example. While developing the plugin you should use the address of your own site instead of the example address.
fr: Dans ce tutoriel nous allons utiliser l'adresse ``http://www.mysite.com/`` comme exemple. Pendant que vous développez le plugin vous devriez utiliser l'adresse de votre propre site au lieu de l'adresse d'exemple.

source: Required files
fr: Fichiers requis

source: First of all you need a directory that will hold all the files required by the plugin. Go to the ``mod`` directory of your Elgg site and create there a directory with the name ``hello_world``.
fr: Avant tout vous devez créer un répertoire qui va contenir tous les fichiers requis par le plugin. Rendez-vous dans le répertoire ``mod`` de votre site Elgg et créez dedans un répertoire portant le nom ``hello_world``.

source: Go to the ``hello_world`` directory and create these two files inside it:
fr: Rendez-vous dans le répertoire ``hello_world`` et créez ces deux fichiers à l'intérieur :

source: Copy this to the ``manifest.xml`` file:
fr: Copiez ceci dans le fichier ``manifest.xml`` :

source: Add your name to the ``<author></author>`` element.
fr: Ajoutez votre nom à l'élément ``<author></author>``.

source: The plugin has now the minimum requirements for your site to recognize it. Log in to your site as an administrator and access the plugins page at the administration panel. By default the plugin is at the bottom of the plugins list. Click the "Activate" button to start it.
fr: Le plugin dispose maintenant des pré-requis minimum pour que votre site puisse le reconnaître. Connectez-vous à votre site en tant qu'administrateur et accédez à la page des plugins du panneau d'administration. Par défaut le plugin est à la fin de la liste des plugins. Cliquez sur le bouton "Activer" pour le démarrer.

source: The Hello world plugin has appeared to the bottom of the plugin list
fr: Le plugin Hello world est apparau à la fin de la liste des plugins

source: Initializing the plugin
fr: Initialiser le plugin

source: The next step is to add some actual features. Open the ``start.php`` and copy this to it:
fr: La prochaine étape est d'ajouter quelques véritables fonctionnalités. Ouvrez le ``start.php`` et copiez ceci dedans :

source: This piece of code tells Elgg that it should call the function ``hello_world_init()`` when the Elgg core system is initiated.
fr: Ce morceau de code indique à Elgg qu'il devrait appeler la fonction ``hello_world_init()`` quand le cœur du système d'Elgg est initialisé.

source: The next step is to register a page handler which has the purpose of handling request that users make to the URL http://www.mysite.com/hello/.
fr: La prochaine étape est d'enregistrer un gestionnaire de page qui a pour objectif de gérer les requêtes que les utilisateurs font sur l'URL http://www.mysite.com/hello/.

source: Update the ``start.php`` to look like this:
fr: Mettez à jour ``start.php`` pour qu'il ressemble à ceci :

source: The call to ``elgg_register_page_handler()`` tells Elgg that it should call the function ``hello_world_page_handler()`` when user goes to your site and has "hello" at the end of the URL.
fr: L'appel de ``elgg_register_page_handler()`` indique à Elgg qu'il devrait appeler la fonction ``hello_world_page_handler()`` quand l'utilisateur va sur votre site et a "hello" à la fin de l'URL.

source: The ``hello_world_page_handler()`` makes it possible for the users to access the actual page. Inside the function we first give an array of parameters to the ``elgg_view_layout()`` function.
fr: ``hello_world_page_handler()`` permet aux utilisateurs d'accéder effectivement à la page. A l'intérieur de la fonction nous allons d'abord donner un tableau de paramètres pour la fonction ``elgg_view_layout()``.

source: The parameters include:
fr: Les paramètres comprennent :

source: The title of the page
fr: Le titre de la page

source: The contents of the page
fr: Le contenu de la page

source: Filter which is left empty because there's currently nothing to filter
fr: Un filter qui est laissé vide puisqu'il n'y a pour le moment rien à filtrer

source: This creates the basic layout for the page. The layout is then run through ``elgg_view_page()`` which assembles and outputs the full page.
fr: Ceci crée l'agencement général (layout) de base pour la page. Cet agencement est ensuite passé à travers ``elgg_view_page()`` qui assemble et génère la page complète.

source: You can now go to the address http://www.mysite.com/hello/ and you should see the page.
fr: Vous pouvez vous rendre à l'adresse http://www.mysite.com/hello/ et vous devriez voir la page.

source: Elgg is now routing the URL http://www.mysite.com/hello/ to the page you created.
fr: Elgg est désormais en train de router l'URL http://www.mysite.com/hello/ vers la page que vous avez créée.

source: Plugin Tutorials
fr: Tutoriels pour créer un plugin

source: Walk through all the required steps in order to create your own plugins.
fr: Suivez toutes les étapes requises pour créer vos propres plugins.

source: The instructions are detailed enough that you don't need much previous experience on plugin development.
fr: Les instructions sont suffisamment détaillées pour que vous n'ayez pas besoin de beaucoup d'expérience précédente de développement de plugin.

source: Customizing the Home Page
fr: Personnaliser la page d'accueil

source: Overwrite the default index page on your Elgg install.
fr: Surchargez la page d'accueil par défaut de votre installation Elgg.

source: Register a function for the plugin hook called ``index, system`` that returns ``true``. This tells Elgg to assume that another front page has been drawn so it doesn't display the default page.
fr: Enregistrez une fonction pour le hook de plugin appelé ``index, system`` qui renvoie ``true``. Ceci indique à Elgg qu'une autre page d'accueil a été générée de sorte qu'il n'affiche pas la page d'accueil par défaut.

source: Inside start.php you will need something like the following:
fr: A l'intérieur de start.php vous aurez besoin de définir quelque chose comme ceci :

source: Then implement the page handler script (/pluginname/pages/index.php) to generate the desired output. Anything output from this script will become your new home page.
fr: Puis implémentez le script de gestion de page (/pluginname/pages/index.php) pour générer le rendu désiré. Toute sortie de ce script deviendra votre nouvelle page d'accueil.

source: Basic Widget
fr: Widget basique

source: Create a widget that will display “Hello, World!” and optionally any text the user wants.
fr: Créez un widget qui va afficher “Hello, World!” ainsi que n'importe quel texte souhaité par l'utilisateur.

source: In Elgg, widgets are those components that you can drag onto your profile or admin dashboard.
fr: Dans Elgg, les widgets sont ces composants que vous pouvez déplacer sur votre page de profil ou le tableau de bord d'administration.

source: This tutorial assumes you are familiar with basic Elgg concepts such as:
fr: Ce tutoriel suppose que vous êtes familier(ère) des concepts de base d'Elgg tels que :

source: You should review those if you get confused along the way.
fr: Vous devriez les revoir si cela devient confus en cours de route.

source: Registering your plugin
fr: Enregistrer votre plugin

source: Plugins are always placed in the ``/mod`` directory. Create a subdirectory there called ``hello``. This will be the name of your plugin and will show up in the Plugins Administration section of Elgg by this name.
fr: Les plugins sont toujours placés dans le répertoire ``/mod``. Créez dedans un sous-répertoire appelé ``hello``. Celui-ci sera le nom de votre plugin et apparaîtra sous ce nom dans la section d'administration des Plugins d'Elgg.

source: In ``/mod/hello``, create an empty file called ``start.php``. If this file exists, Elgg will load your plugin. Otherwise, you will see a misconfigured plugin error. Go to the admin section of your Elgg install and enable your plugin. Click on the “more info” link under your plugin name. You will notice that nothing happens.
fr: Dans ``/mod/hello``, créez un fichier vide appelé ``start.php``. Si ce fichier existe, Elgg va charger votre plugin. Autrement, vous verrez une erreur indiquant que le plugin est mal configuré. Rendez-vous dans la partie Administration de votre installation Elgg et activez votre plugin. Cliquez sur le lien “plus d'informations” sous le nom de votre plugin. Vous pourrez constater que rien ne se produit.

source: Copy the ``manifest.xml`` file from one of the plugins in your elgg install into ``/mod/hello``.
fr: Copiez le fichier ``manifest.xml`` de l'un des plugins de votre installation Elgg dans ``/mod/hello``.

source: Update its values so you are listed as the author and change the description to describe this new plugin.
fr: Mettez à jour ses valeurs de manière à ce que vous apparaissiez comme l'auteur et modifiez la description pour décrire ce nouveau plugin.

source: Reload the Tools Administration page in your browser and check “more info” again.
fr: Rechargez la page d'administration dans votre navigateur et vérifiez à nouveau “plus d'informations”.

source: It will now display the information that you've entered.
fr: Les informations que vous avez entrées sont maintenant affichées.

source: Adding the widget view code
fr: Ajouter le code de la vue du widget
